<?php
$hdjr2015 = array (
  'd0101' => 
  array (
    'y' => '訂盟.納采.造車器.祭祀.祈福.出行.安香.修造.動土.上樑.開市.交易.立券.移徙.入宅.會親友.安機械.栽種.納畜.造屋.起基.安床.造畜椆栖.',
    'j' => '破土.安葬.行喪.開生墳.',
  ),
  'd0201' => 
  array (
    'y' => '沐浴.開倉.出貨財.開市.交易.立券.納財.栽種.納畜.牧養.畋獵.入殮.破土.安葬.',
    'j' => '祈福.嫁娶.安床.入宅.造船.',
  ),
  'd0102' => 
  array (
    'y' => '訂盟.納采.會親友.安機械.開光.修造.動土.豎柱.上樑.造屋.起基.造橋.栽種.納畜.造畜椆栖.移柩.入殮.啟攢.修墳.立碑.安葬.',
    'j' => '祈福.出火.嫁娶.入宅.開市.動土.破土.',
  ),
  'd0103' => 
  array (
    'y' => '祭祀.平治道塗.修墳.除服.成服.餘事勿取.',
    'j' => '移徙.入宅.嫁娶.掘井.安葬.',
  ),
  'd0104' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.祈福.求嗣.彫刻.開光.安香.出行.入學.修造.動土.豎柱.上樑.造屋.起基.安門.出火.移徙.入宅.掘井.造畜椆栖.安葬.破土.除服.成服.',
    'j' => '開市.納采.訂盟.作灶.造廟.造船.經絡.',
  ),
  'd0105' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.求嗣.齋醮.安香.出火.修造.起基.造屋.合脊.安門.安碓磑.動土.上樑.移徙.入宅.',
    'j' => '出行.掘井.破土.行喪.安葬.',
  ),
  'd0106' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.入宅.移徙.安床.修造.動土.進人口.',
    'j' => '掘井.安葬.栽種.出行.作灶.開市.入宅.安門.',
  ),
  'd0107' => 
  array (
    'y' => '破屋.壞垣.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0108' => 
  array (
    'y' => '嫁娶.開市.交易.立券.開光.出行.出火.拆卸.修造.入宅.移徙.動土.破土.移柩.安葬.啟攢.除服.成服.',
    'j' => '安床.伐木.祈福.納畜.',
  ),
  'd0109' => 
  array (
    'y' => '祭祀.入殮.破土.除服.成服.啟攢.安葬.修墳.立碑.餘事勿取.',
    'j' => '餘事勿取.',
  ),
  'd0110' => 
  array (
    'y' => '祭祀.解除.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0111' => 
  array (
    'y' => '開市.交易.立券.納財.納畜.造畜椆栖.入宅.移徙.安床.開光.祈福.求嗣.動土.',
    'j' => '嫁娶.栽種.安葬.理髮.造廟.作灶.入殮.行喪.造橋.',
  ),
  'd0112' => 
  array (
    'y' => '安床.裁衣.交易.立券.入殮.移柩.安葬.除服.成服.',
    'j' => '置產.嫁娶.出行.開光.栽種.動土.破土.入宅.治病.',
  ),
  'd0113' => 
  array (
    'y' => '祭祀.解除.造畜椆栖.教牛馬.針灸.餘事勿取.',
    'j' => '嫁娶.動土.開池.安葬.',
  ),
  'd0114' => 
  array (
    'y' => '沐浴.塑繪.開光.納采.訂盟.開市.交易.立券.納財.起基.動土.定磉.放水.安葬.破土.啟攢.修墳.立碑.移柩.',
    'j' => '入宅.安門.祭祀.謝土.',
  ),
  'd0115' => 
  array (
    'y' => '嫁娶.出行.理髮.安床.啟攢.安葬.修墳.開市.交易.立券.納財.開池.牧養.',
    'j' => '掘井.祈福.謝土.動土.入宅.上樑.修造.作灶.',
  ),
  'd0116' => 
  array (
    'y' => '解除.平治道塗.餘事勿取.',
    'j' => '移徙.入宅.掘井.造廟.栽種.針灸.治病.開池.',
  ),
  'd0117' => 
  array (
    'y' => '嫁娶.祭祀.開光.伐木.出火.拆卸.入宅.移徙.修造.動土.上樑.安床.納畜.',
    'j' => '開市.行喪.栽種.出行.出貨財.安葬.置產.詞訟.治病.',
  ),
  'd0118' => 
  array (
    'y' => '嫁娶.納采.訂盟.入宅.移徙.安床.祭祀.祈福.開光.出行.解除.出火.拆卸.動土.納畜.謝土.安葬.破土.',
    'j' => '伐木.開市.交易.上樑.作灶.安門.造屋.',
  ),
  'd0119' => 
  array (
    'y' => '祭祀.破屋.壞垣.解除.餘事勿取.',
    'j' => '開市.動土.破土.',
  ),
  'd0120' => 
  array (
    'y' => '嫁娶.納采.訂盟.開光.安香.出火.納財.開市.交易.立券.裁衣.造屋.起基.修造.動土.安門.移徙.入宅.栽種.牧養.畋獵.掘井.開池.安葬.破土.入殮.除服.成服.立碑.',
    'j' => '祈福.造廟.祭祀.安床.謝土.',
  ),
  'd0121' => 
  array (
    'y' => '祭祀.齋醮.入殮.破土.啟攢.安葬.修墳.立碑.除服.成服.',
    'j' => '嫁娶.入宅.作灶.納采.訂盟.',
  ),
  'd0122' => 
  array (
    'y' => '祭祀.齋醮.納財.捕捉.畋獵.',
    'j' => '嫁娶.開市.入宅.安床.破土.安葬.',
  ),
  'd0123' => 
  array (
    'y' => '納采.訂盟.祭祀.祈福.求嗣.齋醮.沐浴.進人口.會親友.入學.治病.安碓磑.掘井.開池.納畜.牧養.造畜椆栖.',
    'j' => '嫁娶.合帳.入宅.行喪.安葬.',
  ),
  'd0124' => 
  array (
    'y' => '祭祀.祈福.求嗣.沐浴.問名.交易.納財.入殮.移柩.安葬.修墳.立碑.謝土.造畜椆栖.教牛馬.',
    'j' => '入宅.置產.嫁娶.動土.栽種.開市.開光.動土.破土.',
  ),
  'd0125' => 
  array (
    'y' => '祭祀.教牛馬.造畜椆栖.祭祀.會親友.解除.餘事勿取.',
    'j' => '嫁娶.入宅.出行.動土.破土.安葬.行喪.',
  ),
  'd0126' => 
  array (
    'y' => '嫁娶.開光.解除.出火.拆卸.修造.進人口.入宅.移徙.安床.栽種.入殮.修墳.動土.除服.成服.',
    'j' => '作灶.安葬.祭祀.開市.納采.訂盟.納畜.謝土.出行.探病.',
  ),
  'd0127' => 
  array (
    'y' => '出行.起基.安床.納財.交易.立券.嫁娶.栽種.入殮.移柩.安葬.',
    'j' => '掛匾.入宅.上樑.祈福.詞訟.作樑.作灶.開池.安門.動土.破土.掘井.',
  ),
  'd0128' => 
  array (
    'y' => '平治道塗.餘事勿取.',
    'j' => '開光.嫁娶.開倉.出貨財.造船.安葬.探病.',
  ),
  'd0129' => 
  array (
    'y' => '嫁娶.訂盟.納采.會親友.祭祀.安機械.移徙.入宅.造屋.安床.起基.定磉.安香.出火.掛匾.拆卸.置產.',
    'j' => '開市.出行.安葬.行喪.',
  ),
  'd0130' => 
  array (
    'y' => '沐浴.捕捉.畋獵.理髮.整手足甲.入殮.除服.成服.破土.安葬.謝土.立碑.修墳.啟攢.',
    'j' => '納采.訂盟.嫁娶.上樑.開市.齋醮.造屋.安門.',
  ),
  'd0131' => 
  array (
    'y' => '祭祀.破屋.壞垣.餘事勿取.',
    'j' => '齋醮.嫁娶.開市.',
  ),
  'd0213' => 
  array (
    'y' => '求醫.治病.破屋.壞垣.餘事勿取.',
    'j' => '開市.嫁娶.',
  ),
  'd0226' => 
  array (
    'y' => '納采.訂盟.祭祀.祈福.安香.出火.修造.出行.開市.移徙.入宅.動土.安葬.破土.',
    'j' => '安床.作灶.造船.會親友.',
  ),
  'd0216' => 
  array (
    'y' => '祭祀.沐浴.理髮.作灶.結網.栽種.',
    'j' => '嫁娶.詞訟.行喪.安葬.牧養.伐木.作樑.開市.納畜.造畜椆栖.',
  ),
  'd0223' => 
  array (
    'y' => '嫁娶.祭祀.冠笄.修飾垣牆.置產.',
    'j' => '經絡.探病.造屋.作灶.動土.',
  ),
  'd0203' => 
  array (
    'y' => '嫁娶.納采.訂盟.問名.祭祀.冠笄.裁衣.會親友.進人口.納財.捕捉.作灶.',
    'j' => '開市.安床.安葬.修墳.',
  ),
  'd0206' => 
  array (
    'y' => '祭祀.合帳.裁衣.經絡.伐木.作樑.安床.作灶.入殮.安葬.啟攢.移柩.',
    'j' => '詞訟.出火.入宅.',
  ),
  'd0227' => 
  array (
    'y' => '塞穴.結網.取漁.畋獵.',
    'j' => '嫁娶.安門.移徙.入宅.安葬.',
  ),
  'd0301' => 
  array (
    'y' => '納采.嫁娶.祭祀.祈福.出行.開市.會親友.動土.破土.啟攢.',
    'j' => '移徙.入宅.出火.安門.安葬.',
  ),
  'd0202' => 
  array (
    'y' => '祭祀.沐浴.補垣.塞穴.斷蟻.解除.餘事勿取.',
    'j' => '造廟.入宅.修造.安葬.行喪.嫁娶.',
  ),
  'd0204' => 
  array (
    'y' => '移徙.祭祀.開光.祈福.出行.解除.進人口.雇庸.安床.動土.起基.上樑.安門.解除.',
    'j' => '嫁娶.安葬.破土.作樑.納畜.牧養.行喪.作灶.',
  ),
  'd0205' => 
  array (
    'y' => '嫁娶.開光.祈福.求嗣.解除.動土.安床.栽種.開池.掘井.祭祀.破土.啟攢.',
    'j' => '入宅.作灶.伐木.安葬.出火.出行.納畜.',
  ),
  'd0207' => 
  array (
    'y' => '裁衣.伐木.作樑.納財.交易.立券.',
    'j' => '諸事不宜.',
  ),
  'd0208' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.出火.拆卸.動土.上樑.進人口.入宅.移徙.安床.開市.交易.立券.掛匾.入殮.破土.安葬.啟攢.除服.成服.',
    'j' => '諸事不宜.',
  ),
  'd0209' => 
  array (
    'y' => '嫁娶.冠笄.納采.出行.會親友.上樑.安機械.安床.牧養.畋獵.祭祀.祈福.開光.修造.安門.造屋.起基.',
    'j' => '入宅.作灶.治病.安葬.移徙.',
  ),
  'd0210' => 
  array (
    'y' => '修飾垣牆.平治道塗.祭祀.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0211' => 
  array (
    'y' => '造車器.納采.訂盟.祭祀.祈福.求嗣.移徙.出行.開市.出火.入宅.立券.交易.入宅.安門.安床.安葬.謝土.',
    'j' => '開光.造屋.動土.作灶.栽種.',
  ),
  'd0212' => 
  array (
    'y' => '動土.入殮.嫁娶.移柩.安葬.破土.',
    'j' => '開市.作灶.安床.入宅.上樑.裁衣.',
  ),
  'd0214' => 
  array (
    'y' => '祭祀.齋醮.沐浴.開生墳.除服.成服.移柩.入殮.破土.安葬.合壽木.',
    'j' => '開市.嫁娶.安床.會親友.入宅.作灶.上樑.',
  ),
  'd0215' => 
  array (
    'y' => '祭祀.塞穴.結網.破土.謝土.安葬.移柩.除服.成服.餘事勿取.',
    'j' => '嫁娶.入宅.',
  ),
  'd0217' => 
  array (
    'y' => '嫁娶.祭祀.開光.祈福.求嗣.出行.開市.交易.立券.動土.納財.掘井.會親友.',
    'j' => '入宅.安葬.伐木.作樑.納畜.造畜椆栖.作灶.',
  ),
  'd0218' => 
  array (
    'y' => '祭祀.祈福.求嗣.納畜.入殮.啟攢.謝土.除服.成服.',
    'j' => '栽種.開光.出行.針灸.嫁娶.入宅.動土.破土.',
  ),
  'd0219' => 
  array (
    'y' => '開光.解除.伐木.豎柱.上樑.交易.立券.納畜.入殮.移柩.安葬.',
    'j' => '入宅.出行.移徙.祭祀.嫁娶.動土.破土.作灶.',
  ),
  'd0220' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.嫁娶.出行.解除.伐木.拆卸.進人口.安床.動土.起基.上樑.栽種.納畜.破土.謝土.啟攢.安葬.',
    'j' => '移徙.入宅.出火.作灶.掘井.',
  ),
  'd0221' => 
  array (
    'y' => '會親友.冠笄.安床.會親友.安機械.祭祀.祈福.求嗣.經絡.',
    'j' => '嫁娶.開市.動土.作灶.安葬.',
  ),
  'd0222' => 
  array (
    'y' => '作灶.解除.平治道塗.餘事勿取.',
    'j' => '祭祀.祈福.安葬.安門.',
  ),
  'd0224' => 
  array (
    'y' => '納采.嫁娶.祭祀.祈福.出行.修造.動土.移徙.入宅.安葬.破土.',
    'j' => '開市.入宅.齋醮.',
  ),
  'd0225' => 
  array (
    'y' => '祭祀.沐浴.解除.理髮.掃舍.破屋.壞垣.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd0228' => 
  array (
    'y' => '納采.祭祀.祈福.出行.會親友.修造.動土.移徙.入宅.',
    'j' => '嫁娶.開市.安葬.破土.',
  ),
  'd0327' => 
  array (
    'y' => '冠笄.立券.交易.修造.動土.安機械.入殮.安葬.破土.',
    'j' => '嫁娶.祈福.出火.入宅.',
  ),
  'd0317' => 
  array (
    'y' => '塞穴.整手足甲.解除.捕捉.畋獵.結網.餘事勿取.諸事不宜.',
    'j' => '嫁娶.作灶.掘井.安葬.',
  ),
  'd0231' => 
  array (
    'y' => '納采.嫁娶.祭祀.祈福.出行.開市.會親友.動土.破土.啟攢.',
    'j' => '移徙.入宅.出火.安門.安葬.',
  ),
  'd0328' => 
  array (
    'y' => '祭祀.會親友.出行.立券.交易.冠笄.納財.',
    'j' => '嫁娶.動土.掘井.起基.定磉.破土.',
  ),
  'd0323' => 
  array (
    'y' => '納采.交易.立券.安床.安機械.安葬.移柩.動土.破土.立碑.',
    'j' => '嫁娶.開光.作灶.',
  ),
  'd0307' => 
  array (
    'y' => '祭祀.嫁娶.納婿.安葬.',
    'j' => '栽種.造屋.作灶.入宅.',
  ),
  'd0326' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.出行.修造.動土.移徙.入宅.破土.出火.安門.安床.上樑.立碑.移柩.',
    'j' => '開市.交易.合帳.安葬.',
  ),
  'd0325' => 
  array (
    'y' => '納財.交易.立券.栽種.捕捉.結網.取漁.進人口.教牛馬.理髮.',
    'j' => '入宅.造屋.豎柱.安葬.',
  ),
  'd0427' => 
  array (
    'y' => '納采.祭祀.祈福.求嗣.齋醮.出行.起基.造屋.定磉.安門.入殮.安葬.',
    'j' => '嫁娶.開市.納財.出火.',
  ),
  'd0302' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.入殮.除服.成服.移柩.安葬.啟攢.',
    'j' => '嫁娶.動土.開光.造屋.破土.',
  ),
  'd0303' => 
  array (
    'y' => '納采.會親友.豎柱.上樑.立券.入殮.移柩.安葬.啟攢.',
    'j' => '祭祀.移徙.入宅.動土.破土.',
  ),
  'd0304' => 
  array (
    'y' => '祭祀.祈福.齋醮.出行.開市.立券.動土.移徙.入宅.破土.安葬.',
    'j' => '開光.嫁娶.作灶.掘井.納畜.',
  ),
  'd0305' => 
  array (
    'y' => '會親友.求嗣.理髮.冠笄.結網.捕捉.開光.理髮.',
    'j' => '開市.動土.安葬.破土.',
  ),
  'd0306' => 
  array (
    'y' => '開光.塑繪.求嗣.納采.裁衣.合帳.冠笄.安機械.作樑.開柱眼.安門.安床.造倉.祭祀.會親友.祈福.經絡.納財.開市.立券.交易.入學.求嗣.理髮.架馬.',
    'j' => '出行.齋醮.安葬.嫁娶.',
  ),
  'd0308' => 
  array (
    'y' => '祭祀.會親友.訂盟.裁衣.合帳.安機械.拆卸.上樑.安門.入殮.除服.成服.移柩.啟攢.安葬.立碑.開光.塑繪.入學.出行.起基.定磉.放水.移徙.入宅.豎柱.立券.經絡.',
    'j' => '伐木.作樑.',
  ),
  'd0309' => 
  array (
    'y' => '祭祀.開光.塑繪.祈福.齋醮.裁衣.合帳.冠笄.嫁娶.拆卸.動土.移徙.入宅.入殮.移柩.安葬.謝土.求嗣.入學.理髮.伐木.架馬.作樑.出火.修造.起基.定磉.放水.赴任.',
    'j' => '入宅.安門.',
  ),
  'd0310' => 
  array (
    'y' => '祭祀.治病.破屋.壞垣.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0311' => 
  array (
    'y' => '嫁娶.祭祀.出行.冠笄.立券.交易.進人口.開市.移徙.修造.動土.安床.入殮.移柩.破土.',
    'j' => '開光.作灶.齋醮.安葬.',
  ),
  'd0312' => 
  array (
    'y' => '開市.立券.交易.掛匾.祭祀.祈福.開光.入宅.移徙.安床.拆卸.動土.上樑.進人口.',
    'j' => '嫁娶.行喪.架馬.作樑.理髮.牧養.安葬.納畜.伐木.',
  ),
  'd0313' => 
  array (
    'y' => '理髮.冠笄.嫁娶.進人口.',
    'j' => '置產.伐木.納畜.造畜椆栖.安葬.破土.作樑.作灶.開生墳.',
  ),
  'd0314' => 
  array (
    'y' => '嫁娶.祭祀.開光.祈福.求嗣.出火.入宅.移徙.安床.拆卸.動土.破土.謝土.',
    'j' => '合帳.開市.安葬.入殮.',
  ),
  'd0315' => 
  array (
    'y' => '安床.伐木.拆卸.修造.動土.上樑.立券.交易.栽種.納畜.牧養.入殮.安葬.',
    'j' => '嫁娶.祭祀.開光.出行.出火.移徙.入宅.安門.',
  ),
  'd0316' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.嫁娶.冠笄.出行.開市.交易.會親友.教牛馬.除服.成服.啟攢.安葬.移柩.',
    'j' => '祈福.動土.移徙.入宅.',
  ),
  'd0318' => 
  array (
    'y' => '納財.開市.立券.交易.開光.安床.上樑.造屋.修造.起基.',
    'j' => '動土.破土.安葬.行喪.赴任.出行.嫁娶.入宅.移徙.謝土.詞訟.',
  ),
  'd0319' => 
  array (
    'y' => '祭祀.祈福.嫁娶.冠笄.修飾垣牆.置產.平治道塗.',
    'j' => '開倉.出貨財.造屋.作灶.開市.交易.立券.栽種.',
  ),
  'd0320' => 
  array (
    'y' => '嫁娶.祭祀.開光.祈福.求嗣.出行.出火.進人口.入宅.移徙.安床.拆卸.修造.安門.掛匾.納財.掃舍.',
    'j' => '動土.伐木.安葬.行喪.',
  ),
  'd0321' => 
  array (
    'y' => '嫁娶.開光.祭祀.祈福.求嗣.出行.出火.入宅.移徙.解除.栽種.伐木.破土.謝土.安葬.',
    'j' => '開市.交易.作灶.納財.上樑.安床.造屋.造船.',
  ),
  'd0322' => 
  array (
    'y' => '破屋.壞垣.求醫.治病.餘事勿取.',
    'j' => '開光.嫁娶.',
  ),
  'd0324' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.沐浴.開光.理髮.經絡.解除.治病.治病.立碑.栽種.牧養.掘井.開池.',
    'j' => '嫁娶.定磉.合壽木.安葬.行喪.',
  ),
  'd0329' => 
  array (
    'y' => '祭祀.沐浴.解除.掃舍.塞穴.牧養.',
    'j' => '嫁娶.安葬.行喪.安門.',
  ),
  'd0330' => 
  array (
    'y' => '納財.開市.交易.立券.開光.針灸.會親友.理髮.安床.造倉.結網.',
    'j' => '移徙.入宅.栽種.',
  ),
  'd0331' => 
  array (
    'y' => '嫁娶.冠笄.會親友.安機械.納財.交易.立券.置產.',
    'j' => '開市.造屋.治病.作灶.',
  ),
  'd0422' => 
  array (
    'y' => '祭祀.修飾垣牆.餘事勿取.',
    'j' => '開光.修造.動土.破土.',
  ),
  'd0431' => 
  array (
    'y' => '祭祀.捕捉.解除.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd0402' => 
  array (
    'y' => '祈福.齋醮.出行.移徙.入宅.修造.動土.破土.安葬.',
    'j' => '納采.開光.安床.嫁娶.開市.',
  ),
  'd0412' => 
  array (
    'y' => '開光.出行.交易.塞穴.嫁娶.理髮.開市.安床.',
    'j' => '祈福.出火.置產.動土.破土.安葬.修造.上樑.置產.入宅.',
  ),
  'd0421' => 
  array (
    'y' => '祭祀.出行.修造.動土.合帳.造畜椆栖.安床.移徙.入殮.移柩.破土.啟攢.安葬.開生墳.合壽木.補垣.塞穴.',
    'j' => '移徙.入宅.作灶.理髮.開光.安門.',
  ),
  'd0229' => 
  array (
    'y' => '納采.嫁娶.祭祀.祈福.出行.開市.會親友.動土.破土.啟攢.',
    'j' => '移徙.入宅.出火.安門.安葬.',
  ),
  'd0522' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.開光.出火.出行.拆卸.動土.修造.進人口.入宅.移徙.安床.解除.掛匾.栽種.破土.謝土.入殮.移柩.安葬.',
    'j' => '開市.立券.造船.合壽木.',
  ),
  'd0401' => 
  array (
    'y' => '嫁娶.造車器.納采.訂盟.祭祀.祈福.安機械.移徙.入宅.開市.立券.破土.安葬.',
    'j' => '納畜.理髮.合壽木.',
  ),
  'd0403' => 
  array (
    'y' => '破屋.壞垣.餘事勿取.',
    'j' => '嫁娶.移徙.開市.入宅.',
  ),
  'd0404' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.出行.會親友.修造.動土.入殮.破土.',
    'j' => '塑繪.開光.造橋.除服.成服.',
  ),
  'd0405' => 
  array (
    'y' => '塞穴.掃舍.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0406' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.解除.納采.冠笄.出火.拆卸.進人口.安床.動土.上樑.造廟.掘井.開池.入殮.移柩.安葬.破土.',
    'j' => '',
  ),
  'd0407' => 
  array (
    'y' => '解除.破屋.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0408' => 
  array (
    'y' => '嫁娶.祈福.求嗣.開光.出行.解除.拆卸.出火.開市.立券.交易.入宅.移徙.安床.動土.破土.謝土.',
    'j' => '祭祀.入殮.安葬.探病.',
  ),
  'd0409' => 
  array (
    'y' => '祭祀.裁衣.冠笄.安床.交易.立券.開池.補垣.塞穴.入殮.破土.啟攢.安葬.謝土.除服.成服.',
    'j' => '嫁娶.掘井.探病.開市.開光.栽種.',
  ),
  'd0410' => 
  array (
    'y' => '祭祀.出行.教牛馬.掃舍.餘事勿取.',
    'j' => '開光.伐木.安葬.破土.',
  ),
  'd0411' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.納采.訂盟.解除.栽種.納畜.牧養.掃舍.進人口.',
    'j' => '修墳.造橋.作灶.出行.安葬.造屋.入宅.',
  ),
  'd0413' => 
  array (
    'y' => '祭祀.作灶.畋獵.結網.修飾垣牆.平治道塗.餘事勿取.',
    'j' => '嫁娶.安床.治病.',
  ),
  'd0414' => 
  array (
    'y' => '沐浴.祭祀.解除.安葬.破土.謝土.移柩.餘事勿取.',
    'j' => '齋醮.開光.嫁娶.入宅.上樑.',
  ),
  'd0415' => 
  array (
    'y' => '祭祀.解除.入殮.移柩.啟攢.安葬.整手足甲.捕捉.畋獵.取漁.除服.成服.掃舍.謝土.齋醮.',
    'j' => '動土.破土.',
  ),
  'd0416' => 
  array (
    'y' => '祭祀.沐浴.解除.破屋.壞垣.求醫.治病.餘事勿取.',
    'j' => '嫁娶.開市.',
  ),
  'd0417' => 
  array (
    'y' => '沐浴.塞穴.畋獵.結網.取漁.掃舍.餘事勿取.',
    'j' => '祈福.安葬.',
  ),
  'd0418' => 
  array (
    'y' => '開市.交易.立券.掛匾.祭祀.開光.祈福.求嗣.安床.解除.修造.安葬.',
    'j' => '納采.問名.訂盟.嫁娶.入宅.開倉.出火.動土.破土.納畜.伐木.',
  ),
  'd0419' => 
  array (
    'y' => '祭祀.修門.取漁.納財.納畜.餘事勿取.',
    'j' => '嫁娶.入宅.',
  ),
  'd0420' => 
  array (
    'y' => '安香.出火.納采.訂盟.嫁娶.開市.立券.交易.掛匾.開光.出行.解除.安床.栽種.置產.拆卸.修造.動土.',
    'j' => '作灶.安葬.祭祀.入殮.',
  ),
  'd0423' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.齋醮.開光.出火.移徙.入宅.豎柱.上樑.會親友.造屋.起基.治病.治病.安門.造車器.掘井.開池.',
    'j' => '納采.出行.修墳.安葬.開市.立券.作灶.',
  ),
  'd0424' => 
  array (
    'y' => '祭祀.塑繪.開光.納采.嫁娶.開市.出行.會親友.安床.結網.除服.成服.啟攢.安葬.移柩.',
    'j' => '祈福.入宅.造屋.動土.破土.探病.',
  ),
  'd0425' => 
  array (
    'y' => '祭祀.作灶.平治道塗.餘事勿取.',
    'j' => '安床.入宅.安碓磑.栽種.',
  ),
  'd0426' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.沐浴.納畜.入殮.破土.安葬.',
    'j' => '移徙.入宅.嫁娶.出行.安床.',
  ),
  'd0428' => 
  array (
    'y' => '祭祀.沐浴.解除.求醫.治病.破屋.壞垣.餘事勿取.',
    'j' => '祈福.齋醮.開市.安葬.',
  ),
  'd0429' => 
  array (
    'y' => '沐浴.捕捉.畋獵.結網.取漁.',
    'j' => '祭祀.嫁娶.入宅.作灶.安葬.',
  ),
  'd0430' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.納采.訂盟.開光.豎柱.上樑.開倉.出貨財.造屋.起基.定磉.安門.諸事不宜.破土.入殮.啟攢.謝土.',
    'j' => '出火.嫁娶.開市.',
  ),
  'd0526' => 
  array (
    'y' => '祭祀.結網.捕捉.餘事勿取.',
    'j' => '探病.嫁娶.開市.',
  ),
  'd0230' => 
  array (
    'y' => '納采.嫁娶.祭祀.祈福.出行.開市.會親友.動土.破土.啟攢.',
    'j' => '移徙.入宅.出火.安門.安葬.',
  ),
  'd0516' => 
  array (
    'y' => '嫁娶.交易.立券.作廁.補垣.塞穴.畋獵.取漁.開生墳.',
    'j' => '安床.開渠.上樑.修造.開市.開光.入宅.移徙.安床.',
  ),
  'd0512' => 
  array (
    'y' => '納采.訂盟.嫁娶.造車器.祭祀.祈福.求嗣.開光.出火.拆卸.修造.動土.進人口.掛匾.入宅.移徙.安床.栽種.入殮.破土.安葬.除服.成服.',
    'j' => '開市.立券.',
  ),
  'd0506' => 
  array (
    'y' => '開市.交易.立券.掛匾.開光.出行.拆卸.進人口.入宅.移柩.動土.安門.上樑.栽種.破土.修墳.安葬.',
    'j' => '嫁娶.安床.探病.作灶.',
  ),
  'd0523' => 
  array (
    'y' => '祭祀.沐浴.解除.破屋.壞垣.餘事勿取.',
    'j' => '開光.安葬.',
  ),
  'd0513' => 
  array (
    'y' => '開市.交易.立券.祭祀.祈福.開光.動土.安床.出行.栽種.納畜.牧養.豎柱.上樑.解除.破土.',
    'j' => '嫁娶.掘井.入宅.移徙.安葬.',
  ),
  'd0503' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.冠笄.作灶.納財.交易.',
    'j' => '開光.嫁娶.掘井.安葬.安門.探病.',
  ),
  'd0528' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.出行.移徙.入宅.作灶.造車器.補垣.塞穴.作廁.破土.啟攢.除服.成服.入殮.',
    'j' => '入宅.造屋.造橋.安門.安葬.上樑.',
  ),
  'd0518' => 
  array (
    'y' => '納采.訂盟.嫁娶.祭祀.祈福.求嗣.開光.解除.出行.出火.入宅.移徙.栽種.納畜.牧養.動土.破土.入殮.安葬.',
    'j' => '作灶.安床.開倉.造屋.動土.安葬.',
  ),
  'd0530' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.治病.造車器.修造.動土.移徙.入宅.',
    'j' => '開市.出行.安床.作灶.安葬.',
  ),
  'd0626' => 
  array (
    'y' => '祭祀.沐浴.理髮.整手足甲.修飾垣牆.平治道塗.餘事勿取.',
    'j' => '開市.入宅.出行.修造.詞訟.',
  ),
  'd0501' => 
  array (
    'y' => '祭祀.捕捉.解除.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd0502' => 
  array (
    'y' => '納采.嫁娶.出行.開市.立券.納畜.牧養.出火.移徙.入宅.',
    'j' => '祈福.動土.破土.安葬.入殮.',
  ),
  'd0504' => 
  array (
    'y' => '祭祀.解除.教牛馬.出行.餘事勿取.',
    'j' => '動土.破土.行喪.開光.作樑.安葬.探病.',
  ),
  'd0505' => 
  array (
    'y' => '沐浴.齋醮.解除.求醫.治病.會親友.造畜椆栖.栽種.理髮.掃舍.',
    'j' => '開市.嫁娶.移徙.入宅.掘井.安葬.',
  ),
  'd0507' => 
  array (
    'y' => '進人口.會親友.',
    'j' => '塞穴.上樑.動土.伐木.安葬.詞訟.',
  ),
  'd0508' => 
  array (
    'y' => '沐浴.平治道塗.掃舍.入殮.破土.安葬.除服.成服.',
    'j' => '嫁娶.移徙.伐木.作樑.安床.祭祀.祈福.造屋.',
  ),
  'd0509' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出火.出行.拆卸.動土.解除.進人口.開市.交易.立券.掛匾.入宅.移徙.安床.安門.上樑.安葬.破土.謝土.',
    'j' => '',
  ),
  'd0510' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.解除.合帳.冠笄.伐木.架馬.作樑.修造.進人口.嫁娶.裁衣.合帳.安床.動土.起基.上樑.豎柱.放水.會親友.',
    'j' => '',
  ),
  'd0511' => 
  array (
    'y' => '破屋.壞垣.沐浴.解除.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0514' => 
  array (
    'y' => '解除.出行.納采.冠笄.豎柱.上樑.移徙.作灶.進人口.入宅.納畜.牧養.',
    'j' => '祭祀.伐木.架馬.安床.修造.動土.安葬.修墳.破土.',
  ),
  'd0515' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.出行.開市.交易.立券.栽種.安床.納畜.移徙.起基.動土.定磉.造倉.置產.破土.啟攢.修墳.',
    'j' => '入宅.移徙.修造.安門.伐木.入殮.安葬.造屋.',
  ),
  'd0517' => 
  array (
    'y' => '塞穴.斷蟻.結網.畋獵.餘事勿取.',
    'j' => '嫁娶.安葬.入宅.出行.動土.詞訟.',
  ),
  'd0519' => 
  array (
    'y' => '開光.納采.裁衣.冠笄.安床.作灶.進人口.造倉.塞穴.',
    'j' => '嫁娶.栽種.修造.動土.出行.伐木.作樑.安葬.謝土.',
  ),
  'd0520' => 
  array (
    'y' => '納采.嫁娶.裁衣.理髮.出行.修造.動土.進人口.開市.交易.立券.掛匾.移徙.上樑.栽種.納畜.',
    'j' => '伐木.安葬.安床.祭祀.祈福.',
  ),
  'd0521' => 
  array (
    'y' => '開市.交易.立券.掛匾.祭祀.祈福.齋醮.出行.開市.交易.立券.造屋.起基.修造.動土.定磉.安床.安機械.安葬.破土.啟攢.除服.成服.立碑.',
    'j' => '作灶.嫁娶.移徙.入宅.理髮.',
  ),
  'd0524' => 
  array (
    'y' => '訂盟.納采.嫁娶.解除.祭祀.祈福.求嗣.開光.出行.解除.出火.拆卸.入宅.移徙.安床.栽種.納畜.動土.破土.謝土.安葬.修墳.',
    'j' => '作灶.開市.經絡.',
  ),
  'd0525' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.訂盟.納采.解除.動土.起基.進人口.開市.交易.立券.納財.造倉.開池.栽種.納畜.破土.安葬.',
    'j' => '安床.上樑.裁衣.入宅.嫁娶.',
  ),
  'd0527' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.納采.訂盟.嫁娶.出行.動土.破土.會親友.開市.交易.立券.習藝.拆卸.起基.安碓磑.放水.開池.造倉.開渠.栽種.謝土.啟攢.修墳.立碑.',
    'j' => '入宅.安門.安葬.',
  ),
  'd0529' => 
  array (
    'y' => '祭祀.解除.斷蟻.會親友.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd0531' => 
  array (
    'y' => '嫁娶.納采.訂盟.會親友.安機械.結網.冠笄.祭祀.求嗣.進人口.經絡.',
    'j' => '開市.作灶.動土.行喪.安葬.',
  ),
  'd0624' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.解除.出火.拆卸.修造.進人口.入宅.移徙.動土.安床.納畜.栽種.納財.交易.立券.掛匾.造畜椆栖.',
    'j' => '安葬.開生墳.合壽木.行喪.',
  ),
  'd0614' => 
  array (
    'y' => '嫁娶.祭祀.理髮.作灶.修飾垣牆.平治道塗.整手足甲.沐浴.冠笄.',
    'j' => '破土.出行.栽種.',
  ),
  'd0622' => 
  array (
    'y' => '嫁娶.合帳.裁衣.冠笄.伐木.上樑.出火.拆卸.移徙.修造.動土.安門.納財.築堤.栽種.塞穴.',
    'j' => '安床.祈福.出行.安葬.行喪.開光.',
  ),
  'd0629' => 
  array (
    'y' => '祭祀.沐浴.破屋.壞垣.餘事勿取.',
    'j' => '入宅.嫁娶.移徙.',
  ),
  'd0604' => 
  array (
    'y' => '祭祀.沐浴.解除.破屋.壞垣.餘事勿取.',
    'j' => '行喪.安葬.',
  ),
  'd0628' => 
  array (
    'y' => '納采.訂盟.冠笄.祭祀.祈福.齋醮.出行.修造.動土.移徙.入宅.安香.出火.拆卸.造屋.起基.豎柱.上樑.定磉.安門.開池.',
    'j' => '嫁娶.開市.合壽木.安葬.',
  ),
  'd0618' => 
  array (
    'y' => '祭祀.齋醮.塑繪.開光.出行.修造.動土.造畜椆栖.安床.放水.掘井.開池.作廁.結網.破土.',
    'j' => '出火.入宅.',
  ),
  'd0608' => 
  array (
    'y' => '祭祀.作灶.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0625' => 
  array (
    'y' => '安機械.祭祀.祈福.求嗣.沐浴.解除.納采.開市.修造.豎柱.上樑.開柱眼.安碓磑.歸岫.補垣.塞穴.拆卸.放水.出火.掃舍.開生墳.合壽木.安葬.謝土.啟攢.除服.成服.',
    'j' => '嫁娶.安床.作灶.動土.破土.造船.',
  ),
  'd0630' => 
  array (
    'y' => '嫁娶.安機械.交易.出行.祭祀.祈福.求嗣.齋醮.塑繪.開光.合帳.裁衣.放水.開池.掘井.',
    'j' => '作灶.理髮.造橋.行喪.安葬.',
  ),
  'd0620' => 
  array (
    'y' => '祭祀.結網.餘事勿取.',
    'j' => '入宅.出行.掘井.安葬.',
  ),
  'd0726' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.齋醮.開光.會親友.求醫.治病.造屋.起基.豎柱.上樑.安門.安碓磑.築堤.開池.破土.安葬.除服.成服.',
    'j' => '入宅.開市.掘井.詞訟.合壽木.',
  ),
  'd0601' => 
  array (
    'y' => '祭祀.沐浴.移徙.破土.安葬.掃舍.平治道塗.',
    'j' => '祈福.嫁娶.入宅.安床.作灶.',
  ),
  'd0602' => 
  array (
    'y' => '祭祀.祈福.齋醮.求嗣.安機械.納畜.移徙.入宅.安機械.塑繪.開光.起基.豎柱.上樑.作灶.安門.安香.出火.造屋.啟攢.安葬.',
    'j' => '動土.破土.嫁娶.嫁娶.',
  ),
  'd0603' => 
  array (
    'y' => '嫁娶.納采.訂盟.齋醮.開光.祭祀.祈福.求醫.治病.會親友.動土.解除.捕捉.納畜.牧養.入殮.破土.安葬.',
    'j' => '移徙.入宅.造屋.架馬.',
  ),
  'd0605' => 
  array (
    'y' => '沐浴.掃舍.餘事勿取.',
    'j' => '齋醮.開市.嫁娶.作灶.',
  ),
  'd0606' => 
  array (
    'y' => '開市.交易.立券.納財.開池.作廁.結網.祭祀.修造.動土.安床.放水.經絡.破土.',
    'j' => '嫁娶.造橋.詞訟.移徙.安門.作灶.栽種.',
  ),
  'd0607' => 
  array (
    'y' => '開市.交易.立券.納財.栽種.安床.拆卸.修造.動土.上樑.入殮.安葬.破土.除服.成服.',
    'j' => '嫁娶.出火.伐木.祭祀.入宅.移徙.納畜.探病.',
  ),
  'd0609' => 
  array (
    'y' => '解除.壞垣.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0610' => 
  array (
    'y' => '修造.動土.起基.安門.安床.栽種.築堤.補垣.造畜椆栖.',
    'j' => '嫁娶.掘井.入宅.移徙.出火.出行.行喪.安葬.開光.理髮.進人口.',
  ),
  'd0611' => 
  array (
    'y' => '祭祀.教牛馬.斷蟻.餘事勿取.',
    'j' => '齋醮.移徙.入宅.動土.',
  ),
  'd0612' => 
  array (
    'y' => '納采.訂盟.嫁娶.祭祀.祈福.開市.納財.立券.移徙.出行.修造.動土.起基.定磉.豎柱.拆卸.掃舍.放水.安香.安床.造船.開池.掘井.造畜椆栖.栽種.',
    'j' => '行喪.安葬.破土.作灶.伐木.齋醮.',
  ),
  'd0613' => 
  array (
    'y' => '嫁娶.開光.祭祀.祈福.出行.解除.移徙.入宅.開市.納財.起基.修造.豎柱.上樑.造屋.作灶.出火.安香.補垣.塞穴.拆卸.放水.掃舍.造倉.造船.栽種.安葬.',
    'j' => '納采.訂盟.安床.謝土.破土.動土.',
  ),
  'd0615' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.開光.出火.出行.拆卸.修造.動土.進人口.入宅.移徙.安床.交易.立券.掛匾.納財.入殮.安葬.啟攢.除服.成服.',
    'j' => '動土.掘井.破土.',
  ),
  'd0616' => 
  array (
    'y' => '畋獵.捕捉.結網.取漁.祭祀.沐浴.餘事勿取.',
    'j' => '嫁娶.開市.安葬.啟攢.行喪.',
  ),
  'd0617' => 
  array (
    'y' => '祭祀.破屋.壞垣.餘事勿取.',
    'j' => '移徙.入宅.開倉.出貨財.',
  ),
  'd0619' => 
  array (
    'y' => '開市.交易.立券.掛匾.開光.解除.拆卸.動土.安床.修造.上樑.置產.栽種.破土.安葬.',
    'j' => '作灶.出火.祭祀.嫁娶.入宅.',
  ),
  'd0621' => 
  array (
    'y' => '嫁娶.納采.訂盟.冠笄.造車器.祭祀.開光.祈福.求嗣.出行.解除.伐木.出火.入宅.拆卸.修造.動土.上樑.安床.栽種.破土.',
    'j' => '行喪.置產.入宅.安葬.',
  ),
  'd0623' => 
  array (
    'y' => '出行.教牛馬.割蜜.餘事勿取.',
    'j' => '齋醮.造屋.動土.破土.',
  ),
  'd0627' => 
  array (
    'y' => '嫁娶.納采.祭祀.祈福.出行.立券.移徙.入宅.動土.破土.安葬.',
    'j' => '開光.作灶.造屋.架馬.開倉.',
  ),
  'd0728' => 
  array (
    'y' => '納采.訂盟.嫁娶.祭祀.沐浴.塑繪.開光.出火.治病.習藝.伐木.造屋.豎柱.上樑.安床.作灶.安碓磑.掛匾.掘井.納畜.',
    'j' => '出行.安葬.造橋.',
  ),
  'd0730' => 
  array (
    'y' => '祭祀.修造.出行.造屋.豎柱.造車器.教牛馬.造畜椆栖.割蜜.',
    'j' => '動土.破土.掘井.安葬.',
  ),
  'd0727' => 
  array (
    'y' => '納采.訂盟.嫁娶.移徙.入宅.出行.祭祀.祈福.齋醮.塑繪.開光.安香.出火.會親友.解除.入學.豎柱.上樑.拆卸.造屋.起基.栽種.牧養.納畜.',
    'j' => '安葬.破土.開市.開倉.出貨財.啟攢.',
  ),
  'd0720' => 
  array (
    'y' => '嫁娶.納采.訂盟.造車器.開光.出行.拆卸.起基.安床.除服.成服.開市.交易.立券.栽種.牧養.入殮.移柩.啟攢.',
    'j' => '上樑.入宅.修造.動土.破土.祭祀.祈福.齋醮.',
  ),
  'd0717' => 
  array (
    'y' => '經絡.祭祀.沐浴.補垣.塞穴.除服.成服.移柩.入殮.啟攢.立碑.',
    'j' => '開光.治病.嫁娶.掘井.破土.安葬.',
  ),
  'd0707' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出火.拆卸.修造.動土.進人口.開市.交易.立券.掛匾.入宅.移徙.栽種.納畜.入殮.啟攢.除服.成服.',
    'j' => '',
  ),
  'd0718' => 
  array (
    'y' => '嫁娶.祭祀.出行.裁衣.冠笄.交易.彫刻.納財.造畜椆栖.造車器.彫刻.教牛馬.',
    'j' => '移徙.入宅.栽種.動土.破土.作灶.安葬.行喪.伐木.上樑.',
  ),
  'd0708' => 
  array (
    'y' => '嫁娶.開光.解除.安床.牧養.理髮.開市.入殮.啟攢.移柩.安葬.掃舍.',
    'j' => '作灶.動土.上樑.栽種.入宅.移徙.修造.祈福.',
  ),
  'd0828' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.齋醮.普渡.移徙.入宅.出行.安機械.開光.修造.動土.豎柱.上樑.造屋.起基.定磉.安門.安葬.破土.',
    'j' => '開市.立券.置產.作灶.造橋.',
  ),
  'd0701' => 
  array (
    'y' => '納采.冠笄.求醫.治病.開市.立券.修造.動土.安機械.破土.安葬.',
    'j' => '齋醮.祭祀.移徙.入宅.上樑.嫁娶.',
  ),
  'd0702' => 
  array (
    'y' => '祭祀.作灶.餘事勿取.',
    'j' => '開市.安葬.破土.修墳.掘井.',
  ),
  'd0703' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.安香.解除.移徙.入宅.會親友.求醫.治病.動土.破土.開生墳.合壽木.',
    'j' => '合帳.上樑.經絡.安葬.入殮.',
  ),
  'd0704' => 
  array (
    'y' => '嫁娶.冠笄.修造.動土.作灶.移徙.入宅.補垣.塞穴.納畜.牧養.架馬.修造.動土.起基.定磉.開池.造船.',
    'j' => '祈福.開光.掘井.開市.安葬.',
  ),
  'd0705' => 
  array (
    'y' => '祭祀.交易.納財.',
    'j' => '齋醮.開渠.上樑.動土.破土.',
  ),
  'd0706' => 
  array (
    'y' => '嫁娶.訂盟.納采.冠笄.會親友.安機械.造車器.祭祀.出行.納財.入宅.安香.出火.入學.塑繪.開光.拆卸.起基.修造.動土.牧養.栽種.安門.作廁.',
    'j' => '行喪.伐木.作樑.作灶.',
  ),
  'd0709' => 
  array (
    'y' => '祭祀.解除.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0710' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.伐木.出火.拆卸.入宅.安床.修造.動土.上樑.掛匾.納畜.',
    'j' => '嫁娶.栽種.行喪.理髮.修墳.行喪.作灶.',
  ),
  'd0711' => 
  array (
    'y' => '解除.祭祀.理髮.入殮.安葬.破土.',
    'j' => '嫁娶.開市.出火.作灶.置產.齋醮.入宅.移徙.安門.',
  ),
  'd0712' => 
  array (
    'y' => '破屋.壞垣.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0713' => 
  array (
    'y' => '開市.交易.立券.納財.動土.開光.出行.嫁娶.納采.訂盟.出行.納財.入學.開倉.出貨財.納畜.牧養.栽種.破土.啟攢.安葬.立碑.',
    'j' => '入宅.移徙.作灶.祭祀.謝土.',
  ),
  'd0714' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.開光.出火.出行.拆卸.修造.動土.進人口.開市.交易.立券.掛匾.入宅.移徙.安床.栽種.入殮.破土.謝土.安葬.',
    'j' => '掘井.伐木.納畜.合壽木.',
  ),
  'd0715' => 
  array (
    'y' => '祭祀.冠笄.作灶.交易.納財.栽種.結網.納畜.牧養.進人口.',
    'j' => '開渠.造船.安床.安葬.破土.出行.修墳.掘井.開市.開生墳.',
  ),
  'd0716' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.納采.裁衣.冠笄.開光.安床.作樑.修造.動土.作灶.起基.上樑.造屋.納畜.牧養.',
    'j' => '移徙.栽種.出行.行喪.破土.安葬.詞訟.',
  ),
  'd0719' => 
  array (
    'y' => '修造.動土.安機械.祭祀.沐浴.解除.拆卸.治病.作灶.造屋.起基.開池.掃舍.造畜椆栖.開生墳.合壽木.安葬.破土.啟攢.移柩.入殮.立碑.',
    'j' => '開市.入宅.出行.安床.作灶.',
  ),
  'd0721' => 
  array (
    'y' => '祭祀.嫁娶.畋獵.結網.',
    'j' => '動土.破土.治病.開渠.',
  ),
  'd0722' => 
  array (
    'y' => '納采.訂盟.會親友.入學.祭祀.祈福.求嗣.開光.出行.解除.理髮.動土.起基.開市.交易.立券.納財.造倉.栽種.納畜.牧養.',
    'j' => '嫁娶.作灶.出火.置產.嫁娶.入宅.安葬.',
  ),
  'd0723' => 
  array (
    'y' => '祭祀.祈福.解除.整手足甲.安床.沐浴.入殮.移柩.破土.啟攢.安葬.謝土.',
    'j' => '嫁娶.齋醮.開市.出火.入宅.移徙.出行.作灶.安門.伐木.',
  ),
  'd0724' => 
  array (
    'y' => '破屋.壞垣.解除.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd0725' => 
  array (
    'y' => '嫁娶.開市.立券.移徙.入宅.安機械.會親友.經絡.安門.安床.掛匾.拆卸.開倉.出貨財.開池.栽種.納畜.牧養.破土.安葬.啟攢.移柩.入殮.立碑.',
    'j' => '祭祀.祈福.探病.謝土.造橋.',
  ),
  'd0729' => 
  array (
    'y' => '祭祀.入殮.除服.成服.移柩.破土.啟攢.安葬.塞穴.斷蟻.結網.',
    'j' => '開市.入宅.嫁娶.開光.造屋.',
  ),
  'd0731' => 
  array (
    'y' => '祭祀.沐浴.塑繪.開光.入學.解除.掃舍.治病.開池.牧養.',
    'j' => '嫁娶.出行.納采.入宅.作灶.',
  ),
  'd0827' => 
  array (
    'y' => '祭祀.理髮.作灶.沐浴.修飾垣牆.平治道塗.',
    'j' => '嫁娶.栽種.祈福.造橋.安葬.安門.伐木.作樑.',
  ),
  'd0825' => 
  array (
    'y' => '解除.祭祀.祈福.求嗣.修造.動土.豎柱.上樑.安床.納畜.造屋.合脊.起基.入殮.破土.安葬.',
    'j' => '出火.嫁娶.開光.進人口.出行.詞訟.開市.入宅.移徙.赴任.',
  ),
  'd0817' => 
  array (
    'y' => '破土.安葬.移柩.入殮.祭祀.捕捉.除服.成服.餘事勿取.',
    'j' => '嫁娶.入宅.開市.交易.',
  ),
  'd0815' => 
  array (
    'y' => '修飾垣牆.平治道塗.祭祀.沐浴.作灶.',
    'j' => '嫁娶.詞訟.治病.置產.作樑.祈福.安葬.栽種.伐木.安門.',
  ),
  'd0830' => 
  array (
    'y' => '沐浴.破屋.壞垣.餘事勿取.',
    'j' => '齋醮.開市.',
  ),
  'd0824' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.出行.解除.豎柱.入宅.移徙.納財.上樑.納畜.入殮.安葬.啟攢.',
    'j' => '栽種.掘井.動土.安床.破土.置產.',
  ),
  'd0814' => 
  array (
    'y' => '納采.訂盟.開光.出行.解除.安香.出火.拆卸.入宅.移徙.修造.上樑.安床.栽種.納畜.會親友.安機械.經絡.',
    'j' => '伐木.謝土.行喪.祭祀.作灶.動土.破土.安葬.祈福.',
  ),
  'd0823' => 
  array (
    'y' => '祭祀.出行.作樑.出火.拆卸.修造.動土.起基.安床.補垣.塞穴.入殮.破土.安葬.移柩.造畜椆栖.',
    'j' => '嫁娶.入宅.齋醮.開光.針灸.掘井.',
  ),
  'd0631' => 
  array (
    'y' => '納采.冠笄.求醫.治病.開市.立券.修造.動土.安機械.破土.安葬.',
    'j' => '齋醮.祭祀.移徙.入宅.上樑.嫁娶.',
  ),
  'd0831' => 
  array (
    'y' => '訂盟.納采.祭祀.祈福.安香.出火.開市.立券.入宅.掛匾.造橋.啟攢.安葬.',
    'j' => '動土.破土.嫁娶.掘井.安床.',
  ),
  'd0818' => 
  array (
    'y' => '破屋.壞垣.治病.餘事勿取.',
    'j' => '祈福.納采.訂盟.嫁娶.入宅.安葬.',
  ),
  'd0805' => 
  array (
    'y' => '求醫.治病.破屋.壞垣.餘事勿取.',
    'j' => '嫁娶.出行.',
  ),
  'd0930' => 
  array (
    'y' => '祭祀.出行.',
    'j' => '嫁娶.入宅.修造.動土.會親友.破土.',
  ),
  'd0801' => 
  array (
    'y' => '納財.開市.交易.立券.出行.祭祀.祈福.求嗣.開光.解除.掃舍.起基.豎柱.安床.移徙.開倉.出貨財.補垣.塞穴.栽種.納畜.牧養.',
    'j' => '齋醮.入宅.安門.安葬.破土.行喪.',
  ),
  'd0802' => 
  array (
    'y' => '祭祀.修飾垣牆.平治道塗.',
    'j' => '開市.動土.破土.嫁娶.修造.安葬.',
  ),
  'd0803' => 
  array (
    'y' => '訂盟.納采.祭祀.祈福.開光.安香.出火.立券.安機械.移徙.入宅.豎柱.上樑.會親友.安床.拆卸.掛匾.牧養.教牛馬.',
    'j' => '嫁娶.安葬.行喪.破土.修墳.',
  ),
  'd0804' => 
  array (
    'y' => '沐浴.理髮.捕捉.入殮.移柩.破土.啟攢.安葬.',
    'j' => '出火.嫁娶.入宅.作灶.破土.上樑.動土.',
  ),
  'd0806' => 
  array (
    'y' => '納采.訂盟.嫁娶.移徙.入宅.出行.開市.交易.立券.納財.會親友.安香.出火.拆卸.造屋.起基.安床.作灶.掛匾.安葬.破土.啟攢.立碑.入殮.移柩.',
    'j' => '祈福.上樑.開倉.掘井.牧養.',
  ),
  'd0807' => 
  array (
    'y' => '祭祀.祈福.齋醮.出行.納采.訂盟.安機械.出火.拆卸.修造.動土.起基.移徙.入宅.造廟.入殮.除服.成服.移柩.破土.安葬.謝土.',
    'j' => '嫁娶.開市.栽種.合壽木.',
  ),
  'd0808' => 
  array (
    'y' => '嫁娶.出火.拆卸.祭祀.祈福.開光.伐木.動土.開市.交易.立券.入宅.移徙.安床.納畜.入殮.安葬.',
    'j' => '栽種.作灶.針灸.出行.',
  ),
  'd0809' => 
  array (
    'y' => '祭祀.開光.解除.移徙.裁衣.開市.立券.祈福.求嗣.進人口.交易.納財.納畜.',
    'j' => '動土.破土.理髮.出行.入宅.分居.安香.出火.',
  ),
  'd0810' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.解除.安床.栽種.移柩.進人口.會親友.除服.成服.',
    'j' => '造屋.入殮.安葬.伐木.入宅.移徙.置產.納畜.',
  ),
  'd0811' => 
  array (
    'y' => '祭祀.動土.築堤.開池.會親友.塞穴.入殮.移柩.破土.安葬.',
    'j' => '開光.出行.修造.上樑.入宅.安門.作灶.裁衣.',
  ),
  'd0812' => 
  array (
    'y' => '祭祀.裁衣.安門.納財.掃舍.出行.進人口.作灶.納畜.造畜椆栖.',
    'j' => '安床.動土.安葬.開生墳.合壽木.',
  ),
  'd0813' => 
  array (
    'y' => '祭祀.解除.拆卸.修造.動土.起基.上樑.安床.安門.開渠.開池.入殮.破土.啟攢.',
    'j' => '嫁娶.出行.進人口.作灶.入宅.移徙.栽種.赴任.',
  ),
  'd0816' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.出火.出行.開光.解除.拆卸.修造.進人口.安香.交易.立券.入宅.移徙.安床.動土.破土.謝土.安葬.入殮.除服.成服.',
    'j' => '齋醮.開市.開倉.作灶.造船.',
  ),
  'd0819' => 
  array (
    'y' => '嫁娶.開光.祭祀.祈福.求嗣.安香.出火.解除.伐木.入宅.移徙.安床.開市.交易.立券.栽種.出火.出行.安葬.',
    'j' => '掘井.理髮.作灶.動土.破土.開池.',
  ),
  'd0820' => 
  array (
    'y' => '安機械.納采.訂盟.祭祀.祈福.求嗣.開光.普渡.出行.出火.拆卸.修造.動土.進人口.開市.交易.立券.移徙.安床.栽種.上樑.納畜.破土.移柩.安葬.',
    'j' => '入宅.嫁娶.掘井.牧養.',
  ),
  'd0821' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.裁衣.冠笄.經絡.修造.進人口.安床.動土.豎柱.上樑.移徙.交易.立券.栽種.會親友.',
    'j' => '行喪.安葬.出行.作樑.納畜.伐木.造橋.',
  ),
  'd0822' => 
  array (
    'y' => '嫁娶.納采.訂盟.開光.祭祀.出行.理髮.動土.安床.放水.開渠.栽種.進人口.',
    'j' => '入宅.上樑.入殮.造屋.探病.作灶.安門.安葬.納畜.伐木.',
  ),
  'd0826' => 
  array (
    'y' => '沐浴.理髮.會親友.塑繪.開光.栽種.牧養.嫁娶.經絡.補垣.塞穴.',
    'j' => '開市.入宅.動土.破土.安葬.作灶.上樑.安床.開倉.祈福.',
  ),
  'd0829' => 
  array (
    'y' => '祭祀.普渡.捕捉.解除.結網.畋獵.入殮.破土.安葬.',
    'j' => '開市.交易.入宅.嫁娶.',
  ),
  'd0920' => 
  array (
    'y' => '納采.訂盟.開市.交易.立券.掛匾.納財.栽種.進人口.入宅.移徙.安床.開光.出火.拆卸.安門.修造.',
    'j' => '齋醮.嫁娶.行喪.動土.作灶.安葬.破土.',
  ),
  'd1030' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.齋醮.開光.安香.出火.造廟.移徙.出行.入宅.造廟.起基.豎柱.上樑.安床.納畜.捕捉.納婿.安葬.',
    'j' => '開市.破土.掘井.合壽木.',
  ),
  'd0901' => 
  array (
    'y' => '嫁娶.祭祀.祈福.齋醮.普渡.移徙.入宅.動土.治病.開市.交易.立券.開光.修造.造車器.安香.安床.捕捉.畋獵.結網.',
    'j' => '納采.訂盟.經絡.行喪.安葬.探病.',
  ),
  'd0902' => 
  array (
    'y' => '嫁娶.訂盟.納采.作灶.冠笄.裁衣.會親友.納畜.牧養.安機械.開市.立券.納財.安床.',
    'j' => '掘井.出行.破土.行喪.安葬.',
  ),
  'd0903' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.齋醮.普渡.解除.出行.會親友.開市.納財.修造.動土.豎柱.上樑.開光.開倉.出貨財.納畜.牧養.開池.破土.啟攢.',
    'j' => '出火.入宅.造屋.安門.安葬.',
  ),
  'd0904' => 
  array (
    'y' => '嫁娶.普渡.祭祀.祈福.補垣.塞穴.斷蟻.築堤.入殮.除服.成服.安葬.',
    'j' => '動土.破土.掘井.開光.上樑.詞訟.',
  ),
  'd0905' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.沐浴.普渡.出行.納財.掃舍.納畜.赴任.',
    'j' => '開市.動土.破土.安床.開倉.上樑.',
  ),
  'd0906' => 
  array (
    'y' => '祭祀.沐浴.理髮.整手足甲.冠笄.解除.入殮.移柩.破土.啟攢.安葬.',
    'j' => '嫁娶.出行.入宅.開市.安門.',
  ),
  'd0907' => 
  array (
    'y' => '塑繪.冠笄.嫁娶.會親友.進人口.經絡.裁衣.栽種.納畜.牧養.補垣.塞穴.捕捉.',
    'j' => '祈福.開市.動土.行喪.安葬.',
  ),
  'd0908' => 
  array (
    'y' => '開市.交易.立券.掛匾.開光.出行.入宅.移徙.安床.出火.上樑.',
    'j' => '作灶.行喪.理髮.乘船.嫁娶.安葬.',
  ),
  'd0909' => 
  array (
    'y' => '祭祀.沐浴.修飾垣牆.平治道塗.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0910' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.出火.拆卸.修造.動土.進人口.入宅.移徙.安床.開市.交易.立券.掛匾.栽種.納畜.入殮.安葬.除服.成服.',
    'j' => '',
  ),
  'd0911' => 
  array (
    'y' => '解除.壞垣.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0912' => 
  array (
    'y' => '祭祀.治病.破屋.壞垣.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd0913' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.開光.出行.理髮.作樑.出火.拆卸.修造.動土.進人口.入宅.移徙.安床.移徙.拆卸.掛匾.栽種.納畜.破土.安葬.入殮.除服.成服.',
    'j' => '開市.掘井.開渠.造橋.造船.',
  ),
  'd0914' => 
  array (
    'y' => '開市.交易.立券.納財.掛匾.栽種.祭祀.祈福.開光.拆卸.動土.安床.',
    'j' => '嫁娶.破土.進人口.出行.入宅.移徙.出火.納畜.詞訟.安葬.',
  ),
  'd0915' => 
  array (
    'y' => '嫁娶.祭祀.理髮.進人口.作灶.移柩.冠笄.會親友.',
    'j' => '開倉.出貨財.伐木.納畜.開市.上樑.造屋.破土.啟攢.栽種.',
  ),
  'd0916' => 
  array (
    'y' => '祭祀.修墳.除服.成服.啟攢.移柩.餘事勿取.',
    'j' => '開市.入宅.嫁娶.動土.破土.安葬.',
  ),
  'd0917' => 
  array (
    'y' => '嫁娶.冠笄.安機械.解除.納畜.牧養.沐浴.伐木.架馬.作樑.安門.掃舍.合壽木.安葬.啟攢.立碑.修墳.',
    'j' => '祈福.開光.開市.入宅.動土.',
  ),
  'd0918' => 
  array (
    'y' => '祭祀.出行.沐浴.掃舍.安葬.餘事勿取.',
    'j' => '動土.破土.置產.掘井.',
  ),
  'd0919' => 
  array (
    'y' => '嫁娶.納采.祭祀.解除.出行.修造.動土.開市.上樑.安床.整手足甲.掃舍.求醫.治病.起基.定磉.造屋.合脊.',
    'j' => '造廟.行喪.安葬.伐木.作灶.造船.',
  ),
  'd0921' => 
  array (
    'y' => '祭祀.沐浴.修飾垣牆.平治道塗.餘事勿取.',
    'j' => '嫁娶.入宅.安床.出行.',
  ),
  'd0922' => 
  array (
    'y' => '開光.祈福.求嗣.齋醮.修造.動土.納財.造倉.作廁.栽種.牧養.會親友.',
    'j' => '作灶.出火.進人口.開渠.入宅.移徙.祭祀.',
  ),
  'd0923' => 
  array (
    'y' => '開光.解除.拆卸.修造.動土.豎柱.安門.牧養.安葬.修墳.破土.移柩.',
    'j' => '出火.入宅.移徙.祈福.祭祀.安床.開市.嫁娶.探病.',
  ),
  'd0924' => 
  array (
    'y' => '破屋.壞垣.求醫.治病.餘事勿取.',
    'j' => '移徙.入宅.',
  ),
  'd0925' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.開光.出行.出火.拆卸.修造.動土.進人口.入宅.移徙.安床.上樑.合脊.放水.掘井.破土.移柩.謝土.除服.成服.',
    'j' => '開市.開倉.安門.安葬.',
  ),
  'd0926' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.祈福.求嗣.開光.解除.進人口.入宅.移徙.出火.安床.開市.交易.立券.掛匾.',
    'j' => '安葬.納畜.出行.行喪.伐木.栽種.造廟.造橋.',
  ),
  'd0927' => 
  array (
    'y' => '祭祀.冠笄.捕捉.餘事勿取.',
    'j' => '嫁娶.開市.造屋.作樑.合壽木.',
  ),
  'd0928' => 
  array (
    'y' => '祭祀.解除.結網.畋獵.取漁.會親友.入學.移柩.啟攢.除服.成服.',
    'j' => '開市.祈福.動土.破土.入殮.安葬.造船.',
  ),
  'd0929' => 
  array (
    'y' => '冠笄.沐浴.出行.修造.動土.移徙.入宅.破土.安葬.',
    'j' => '嫁娶.開市.祭祀.祈福.齋醮.納采.修墳.',
  ),
  'd1020' => 
  array (
    'y' => '祭祀.求嗣.冠笄.進人口.會親友.安門.安床.經絡.納財.牧養.畋獵.放水.割蜜.',
    'j' => '祈福.齋醮.納采.訂盟.嫁娶.入宅.安葬.',
  ),
  'd1022' => 
  array (
    'y' => '祭祀.冠笄.移徙.會親友.納財.理髮.捕捉.',
    'j' => '嫁娶.開市.開池.作廁.破土.',
  ),
  'd1010' => 
  array (
    'y' => '嫁娶.祭祀.作灶.納財.',
    'j' => '安葬.開市.修墳.立碑.',
  ),
  'd0931' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.出行.修造.動土.移徙.入宅.',
    'j' => '針灸.伐木.作樑.造廟.行喪.安葬.',
  ),
  'd1024' => 
  array (
    'y' => '嫁娶.裁衣.冠笄.合帳.祭祀.出行.安床.移徙.塞穴.入殮.破土.移柩.安葬.',
    'j' => '開市.出行.栽種.置產.詞訟.安門.掘井.開光.',
  ),
  'd1012' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.動土.安床.掃舍.入殮.移柩.破土.啟攢.安葬.作灶.整手足甲.補垣.除服.成服.',
    'j' => '開光.栽種.',
  ),
  'd1002' => 
  array (
    'y' => '出行.開市.交易.立券.安機械.出火.上樑.移徙.',
    'j' => '嫁娶.安葬.動土.造橋.',
  ),
  'd1027' => 
  array (
    'y' => '納采.訂盟.開市.交易.立券.會親友.納畜.牧養.問名.移徙.解除.作廁.入學.起基.安床.開倉.出貨財.安葬.啟攢.入殮.除服.成服.',
    'j' => '入宅.上樑.齋醮.出火.謝土.',
  ),
  'd1124' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.開光.出行.解除.伐木.出火.入宅.移徙.拆卸.修造.栽種.安葬.入殮.',
    'j' => '破土.動土.安門.作灶.開市.交易.',
  ),
  'd1001' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.出行.修造.動土.移徙.入宅.',
    'j' => '針灸.伐木.作樑.造廟.行喪.安葬.',
  ),
  'd1003' => 
  array (
    'y' => '祭祀.沐浴.修飾垣牆.平治道塗.餘事勿取.',
    'j' => '齋醮.嫁娶.移徙.出行.上樑.入宅.',
  ),
  'd1004' => 
  array (
    'y' => '嫁娶.造車器.安機械.祭祀.祈福.開光.安香.出火.出行.開市.立券.修造.動土.移徙.入宅.破土.安葬.',
    'j' => '納采.訂盟.架馬.詞訟.開渠.',
  ),
  'd1005' => 
  array (
    'y' => '沐浴.捕捉.入殮.除服.成服.破土.啟攢.安葬.',
    'j' => '祭祀.嫁娶.安床.開市.入宅.探病.上樑.',
  ),
  'd1006' => 
  array (
    'y' => '餘事勿取.',
    'j' => '探病.餘事勿取.',
  ),
  'd1007' => 
  array (
    'y' => '訂盟.納采.祭祀.祈福.安香.出火.修造.動土.上樑.安門.起基.豎柱.上樑.定磉.開池.移徙.入宅.立券.破土.',
    'j' => '嫁娶.造廟.造橋.造船.作灶.安葬.',
  ),
  'd1008' => 
  array (
    'y' => '嫁娶.求嗣.納采.進人口.納財.結網.納畜.牧養.會親友.',
    'j' => '上樑.作灶.伐木.出行.安葬.安門.理髮.',
  ),
  'd1009' => 
  array (
    'y' => '嫁娶.祭祀.開市.開光.出行.入宅.移徙.出火.拆卸.修造.安床.',
    'j' => '納畜.伐木.置產.作樑.行喪.安葬.修墳.立碑.',
  ),
  'd1011' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.解除.出火.進人口.開市.交易.立券.掛匾.納財.入宅.移徙.栽種.破土.謝土.',
    'j' => '安床.安葬.',
  ),
  'd1013' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.出行.解除.上樑.入宅.移徙.安床.安門.納財.納畜.造畜椆栖.',
    'j' => '伐木.行喪.破土.嫁娶.安葬.開渠.',
  ),
  'd1014' => 
  array (
    'y' => '祭祀.開光.出行.解除.理髮.伐木.出火.拆卸.上樑.合脊.安床.造畜椆栖.',
    'j' => '嫁娶.安葬.行喪.詞訟.造橋.作灶.破土.動土.',
  ),
  'd1015' => 
  array (
    'y' => '納采.訂盟.會親友.沐浴.理髮.裁衣.冠笄.安床.除服.成服.啟攢.移柩.安葬.會親友.開生墳.',
    'j' => '開市.入宅.出行.嫁娶.修墳.祈福.動土.入宅.安門.謝土.上樑.',
  ),
  'd1016' => 
  array (
    'y' => '解除.祭祀.修飾垣牆.平治道塗.造畜椆栖.餘事勿取.',
    'j' => '嫁娶.開市.交易.入宅.入學.安葬.',
  ),
  'd1017' => 
  array (
    'y' => '入殮.破土.啟攢.安葬.除服.成服.餘事勿取.',
    'j' => '開市.入宅.祭祀.置產.補垣.塞穴.',
  ),
  'd1018' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.拆卸.修造.動土.上樑.安床.納畜.入殮.破土.',
    'j' => '入宅.移徙.掘井.理髮.伐木.交易.開市.作灶.',
  ),
  'd1019' => 
  array (
    'y' => '祭祀.沐浴.破屋.壞垣.餘事勿取.',
    'j' => '嫁娶.入宅.上樑.出行.安葬.',
  ),
  'd1021' => 
  array (
    'y' => '嫁娶.納采.訂盟.開市.交易.立券.掛匾.祭祀.祈福.開光.造車器.掛匾.出行.入宅.移徙.安床.安門.拆卸.修造.動土.栽種.安葬.破土.啟攢.除服.成服.入殮.立碑.',
    'j' => '探病.納畜.伐木.起基.作樑.造屋.',
  ),
  'd1023' => 
  array (
    'y' => '祭祀.祈福.求嗣.齋醮.開光.出行.嫁娶.求醫.治病.動土.破土.入學.起基.掃舍.豎柱.上樑.開倉.出貨財.置產.栽種.牧養.開生墳.謝土.立碑.',
    'j' => '安門.安床.裁衣.入宅.安葬.',
  ),
  'd1025' => 
  array (
    'y' => '祭祀.造車器.出行.修造.上樑.造屋.安門.安床.造畜椆栖.教牛馬.',
    'j' => '出貨財.開倉.動土.破土.安葬.行喪.伐木.開渠.栽種.',
  ),
  'd1026' => 
  array (
    'y' => '祭祀.開光.出行.解除.伐木.作樑.出火.拆卸.入宅.移徙.安床.修造.造畜椆栖.掃舍.',
    'j' => '造廟.嫁娶.掘井.栽種.造橋.作灶.動土.',
  ),
  'd1028' => 
  array (
    'y' => '祭祀.平治道塗.餘事勿取.',
    'j' => '嫁娶.開市.',
  ),
  'd1029' => 
  array (
    'y' => '捕捉.畋獵.餘事勿取.',
    'j' => '開市.交易.祭祀.入宅.安葬.',
  ),
  'd1031' => 
  array (
    'y' => '祭祀.沐浴.解除.破屋.壞垣.餘事勿取.',
    'j' => '開市.嫁娶.',
  ),
  'd1104' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.出行.求醫.治病.出火.移徙.入宅.',
    'j' => '開市.開倉.出貨財.安床.安門.安葬.',
  ),
  'd1121' => 
  array (
    'y' => '祭祀.塑繪.理髮.會親友.牧養.開池.造畜椆栖.畋獵.結網.',
    'j' => '祈福.謝土.安葬.上樑.作灶.開市.嫁娶.出行.入宅.動土.',
  ),
  'd1224' => 
  array (
    'y' => '納采.訂盟.祭祀.祈福.求嗣.塑繪.解除.拆卸.修造.動土.豎柱.上樑.安門.置產.開池.掘井.納畜.安床.栽種.造畜椆栖.破土.移柩.立碑.',
    'j' => '嫁娶.開市.出火.進人口.入殮.赴任.入宅.移徙.出行.安葬.',
  ),
  'd1101' => 
  array (
    'y' => '訂盟.納采.會親友.交易.立券.納財.栽種.納畜.牧養.',
    'j' => '嫁娶.開市.入宅.祈福.安葬.',
  ),
  'd1102' => 
  array (
    'y' => '造車器.嫁娶.訂盟.納采.會親友.祭祀.出行.開市.立券.移徙.入宅.破土.安葬.',
    'j' => '上樑.開光.造屋.架馬.合壽木.',
  ),
  'd1103' => 
  array (
    'y' => '祭祀.作灶.納財.捕捉.畋獵.餘事勿取.',
    'j' => '動土.破土.開市.安葬.',
  ),
  'd1105' => 
  array (
    'y' => '冠笄.祭祀.沐浴.作灶.理髮.整手足甲.掃舍.補垣.塞穴.入殮.破土.啟攢.',
    'j' => '開光.嫁娶.會親友.栽種.針灸.安葬.',
  ),
  'd1106' => 
  array (
    'y' => '納采.訂盟.嫁娶.祭祀.祈福.求嗣.置產.求醫.治病.開市.交易.立券.會親友.移徙.豎柱.上樑.造屋.合脊.安門.放水.捕捉.納畜.',
    'j' => '造廟.造船.動土.破土.安葬.',
  ),
  'd1107' => 
  array (
    'y' => '出行.造車器.造畜椆栖.解除.冠笄.裁衣.作樑.彫刻.會親友.移徙.入宅.安機械.造畜椆栖.開市.掃舍.',
    'j' => '嫁娶.動土.破土.修墳.',
  ),
  'd1108' => 
  array (
    'y' => '嫁娶.開光.出行.解除.出火.拆卸.修造.進人口.動土.入宅.移徙.栽種.納畜.掘井.安葬.除服.成服.',
    'j' => '置產.安床.',
  ),
  'd1109' => 
  array (
    'y' => '開光.裁衣.安門.會親友.安床.結網.理髮.',
    'j' => '嫁娶.冠笄.出行.祈福.安葬.伐木.入宅.移徙.出火.栽種.動土.上樑.',
  ),
  'd1110' => 
  array (
    'y' => '嫁娶.開光.出行.出火.拆卸.修造.動土.入宅.移徙.安床.上樑.開市.交易.立券.栽種.',
    'j' => '祈福.祭祀.伐木.掘井.作灶.謝土.',
  ),
  'd1111' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出火.出行.拆卸.開市.交易.立券.掛匾.伐木.入宅.移徙.安床.安葬.',
    'j' => '栽種.掘井.置產.',
  ),
  'd1112' => 
  array (
    'y' => '祭祀.理髮.針灸.解除.進人口.整手足甲.',
    'j' => '嫁娶.動土.造船.開池.掘井.出行.修造.入宅.上樑.移徙.安葬.破土.作灶.開市.',
  ),
  'd1113' => 
  array (
    'y' => '破屋.壞垣.求醫.治病.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd1114' => 
  array (
    'y' => '納采.訂盟.嫁娶.祭祀.祈福.彫刻.移徙.開市.入宅.出行.動土.會親友.入學.修造.動土.起基.安門.安床.造廟.解除.納財.開池.造畜椆栖.牧養.牧養.',
    'j' => '上樑.開倉.出貨財.造屋.造船.',
  ),
  'd1115' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.解除.伐木.拆卸.修造.栽種.納畜.安葬.修墳.立碑.',
    'j' => '嫁娶.進人口.入宅.移徙.出火.出行.',
  ),
  'd1116' => 
  array (
    'y' => '沐浴.掃舍.捕捉.畋獵.解除.塞穴.餘事勿取.',
    'j' => '嫁娶.入宅.開市.安床.破土.修墳.',
  ),
  'd1117' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.祈福.求嗣.齋醮.開光.出行.解除.動土.開市.交易.立券.掛匾.拆卸.破土.',
    'j' => '伐木.上樑.修造.入殮.理髮.會親友.入宅.安門.安葬.作灶.',
  ),
  'd1118' => 
  array (
    'y' => '合帳.裁衣.嫁娶.安床.入殮.移柩.破土.造畜椆栖.',
    'j' => '置產.造船.開光.掘井.作灶.',
  ),
  'd1119' => 
  array (
    'y' => '解除.修飾垣牆.冠笄.出行.餘事勿取.',
    'j' => '開市.動土.破土.嫁娶.安葬.',
  ),
  'd1120' => 
  array (
    'y' => '納采.訂盟.嫁娶.祭祀.祈福.求嗣.開光.出行.解除.進人口.開市.立券.掛匾.入宅.移徙.安門.栽種.動土.求醫.治病.會親友.起基.修造.造屋.安葬.',
    'j' => '作灶.經絡.安床.',
  ),
  'd1122' => 
  array (
    'y' => '出行.納財.開市.交易.立券.動土.移徙.入宅.裁衣.會親友.拆卸.進人口.安香.經絡.出貨財.修飾垣牆.平治道塗.',
    'j' => '造廟.謝土.作灶.作樑.伐木.安葬.行喪.修墳.探病.',
  ),
  'd1123' => 
  array (
    'y' => '嫁娶.納采.訂盟.祭祀.齋醮.開光.安香.出火.出行.出火.拆卸.動土.祈福.進人口.納財.交易.立券.移徙.安床.修造.安葬.除服.成服.',
    'j' => '置產.掘井.詞訟.栽種.',
  ),
  'd1125' => 
  array (
    'y' => '祭祀.解除.破屋.壞垣.求醫.治病.餘事勿取.',
    'j' => '嫁娶.安葬.',
  ),
  'd1126' => 
  array (
    'y' => '祭祀.掃舍.破土.安葬.除服.成服.啟攢.移柩.入殮.立碑.餘事勿取.',
    'j' => '祭祀.嫁娶.入宅.修造.動土.',
  ),
  'd1127' => 
  array (
    'y' => '訂盟.納采.會親友.祭祀.祈福.修造.動土.安機械.破土.安葬.',
    'j' => '嫁娶.移徙.出火.開市.入宅.',
  ),
  'd1128' => 
  array (
    'y' => '祭祀.沐浴.捕捉.畋獵.結網.掃舍.',
    'j' => '嫁娶.納采.訂盟.安床.動土.破土.安葬.',
  ),
  'd1129' => 
  array (
    'y' => '開市.納財.出行.祭祀.祈福.求嗣.齋醮.問名.入學.起基.定磉.置產.開渠.掘井.拆卸.栽種.納畜.牧養.動土.破土.啟攢.',
    'j' => '移徙.入宅.出火.入殮.安葬.',
  ),
  'd1130' => 
  array (
    'y' => '祭祀.理髮.置產.塞穴.除服.成服.移柩.入殮.破土.安葬.',
    'j' => '嫁娶.入宅.安床.掘井.開光.',
  ),
  'd1214' => 
  array (
    'y' => '交易.進人口.祭祀.沐浴.捕捉.入殮.除服.成服.安葬.謝土.啟攢.修墳.',
    'j' => '齋醮.入宅.修造.動土.破土.',
  ),
  'd1204' => 
  array (
    'y' => '納采.移徙.納財.開市.交易.立券.納財.入宅.修造.動土.豎柱.起基.定磉.造廟.安香.出火.修飾垣牆.平治道塗.會親友.出行.開池.作廁.',
    'j' => '開倉.造屋.造橋.祭祀.',
  ),
  'd1221' => 
  array (
    'y' => '安床.架馬.祭祀.塑繪.開光.出行.理髮.伐木.作樑.開柱眼.作廁.畋獵.破土.入殮.除服.成服.移柩.啟攢.修墳.立碑.',
    'j' => '作灶.安門.造橋.開市.安葬.',
  ),
  'd1228' => 
  array (
    'y' => '訂盟.納采.會親友.安機械.開光.修造.動土.豎柱.上樑.造屋.起基.造橋.栽種.納畜.造畜椆栖.移柩.入殮.啟攢.修墳.立碑.安葬.',
    'j' => '祈福.出火.嫁娶.入宅.開市.動土.破土.',
  ),
  'd1208' => 
  array (
    'y' => '破屋.壞垣.祭祀.沐浴.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd1201' => 
  array (
    'y' => '祭祀.沐浴.出行.餘事勿取.',
    'j' => '開市.動土.破土.行喪.安葬.',
  ),
  'd1202' => 
  array (
    'y' => '嫁娶.造車器.出行.會親友.移徙.入宅.修造.動土.彫刻.開光.安香.出火.理髮.會親友.造屋.合脊.起基.歸岫.安門.拆卸.掃舍.栽種.造畜椆栖.',
    'j' => '開市.納采.造廟.安床.開渠.安葬.',
  ),
  'd1203' => 
  array (
    'y' => '塑繪.會親友.安機械.塞穴.結網.裁衣.經絡.',
    'j' => '嫁娶.開市.祈福.齋醮.安葬.',
  ),
  'd1205' => 
  array (
    'y' => '訂盟.納采.納財.開市.立券.祭祀.祈福.移徙.入宅.出行.造屋.起基.修造.動土.豎柱.上樑.安門.安香.出火.教牛馬.會親友.破土.',
    'j' => '嫁娶.安葬.掘井.置產.造船.',
  ),
  'd1206' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.塑繪.開光.移徙.安床.伐木.作樑.捕捉.畋獵.結網.求醫.治病.解除.安葬.除服.成服.移柩.入殮.立碑.謝土.',
    'j' => '開市.造廟.動土.破土.',
  ),
  'd1207' => 
  array (
    'y' => '祭祀.解除.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd1209' => 
  array (
    'y' => '安床.祭祀.祈福.求嗣.冠笄.伐木.架馬.動土.開池.作廁.結網.入殮.除服.成服.',
    'j' => '安門.栽種.作灶.治病.',
  ),
  'd1210' => 
  array (
    'y' => '解除.掃舍.餘事勿取.',
    'j' => '諸事不宜.',
  ),
  'd1211' => 
  array (
    'y' => '祭祀.開光.理髮.整手足甲.安床.作灶.掃舍.教牛馬.',
    'j' => '伐木.納畜.破土.安葬.開生墳.嫁娶.開市.動土.交易.作樑.',
  ),
  'd1212' => 
  array (
    'y' => '祭祀.祈福.求嗣.開光.拆卸.修造.動土.上樑.安床.置產.栽種.破土.',
    'j' => '嫁娶.進人口.安葬.出行.赴任.入宅.移徙.入殮.開渠.',
  ),
  'd1213' => 
  array (
    'y' => '沐浴.冠笄.補垣.塞穴.合帳.裁衣.修造.作樑.開柱眼.安碓磑.築堤.作廁.斷蟻.',
    'j' => '移徙.入宅.嫁娶.祈福.開光.掘井.',
  ),
  'd1215' => 
  array (
    'y' => '嫁娶.納采.訂盟.造車器.祭祀.祈福.造廟.安香.出火.出行.歸寧.入學.入宅.交易.立券.求醫.治病.修造.動土.豎柱.上樑.造屋.起基.安門.',
    'j' => '齋醮.伐木.作樑.安葬.行喪.',
  ),
  'd1216' => 
  array (
    'y' => '納采.訂盟.開市.交易.立券.出行.會親友.安機械.豎柱.上樑.平治道塗.伐木.拆卸.造屋.起基.安床.安門.解除.安葬.啟攢.除服.成服.修墳.立碑.移柩.入殮.',
    'j' => '嫁娶.動土.破土.祈福.出火.入宅.',
  ),
  'd1217' => 
  array (
    'y' => '祭祀.平治道塗.除服.成服.安葬.餘事勿取.',
    'j' => '嫁娶.入宅.納采.訂盟.掘井.',
  ),
  'd1218' => 
  array (
    'y' => '納采.訂盟.祭祀.祈福.開光.安香.出火.出行.會親友.安機械.修造.動土.豎柱.上樑.造屋.起基.定磉.安床.安門.拆卸.移徙.造橋.造船.安葬.破土.入殮.',
    'j' => '開市.造廟.置產.掘井.',
  ),
  'd1219' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.祈福.求嗣.齋醮.進人口.會親友.伐木.作樑.開柱眼.安床.掘井.捕捉.畋獵.',
    'j' => '開生墳.破土.行喪.安葬.',
  ),
  'd1220' => 
  array (
    'y' => '破屋.壞垣.治病.餘事勿取.',
    'j' => '移徙.入宅.',
  ),
  'd1222' => 
  array (
    'y' => '嫁娶.祭祀.祈福.求嗣.開光.出行.解除.入宅.移徙.納畜.入殮.破土.修墳.立碑.',
    'j' => '伐木.作樑.動土.安床.破土.栽種.造橋.',
  ),
  'd1223' => 
  array (
    'y' => '祭祀.沐浴.理髮.納財.進人口.栽種.掃舍.捕捉.畋獵.結網.',
    'j' => '會親友.安葬.入宅.移徙.安床.開市.行喪.出火.作灶.安門.',
  ),
  'd1225' => 
  array (
    'y' => '入宅.移徙.出行.進人口.修造.動土.起基.上樑.安門.造倉.補垣.塞穴.造畜椆栖.',
    'j' => '嫁娶.開市.安床.栽種.安葬.祈福.開光.掘井.安葬.',
  ),
  'd1226' => 
  array (
    'y' => '造畜椆栖.教牛馬.',
    'j' => '入宅.移徙.分居.作灶.出火.安香.動土.嫁娶.掘井.掃舍.造橋.',
  ),
  'd1227' => 
  array (
    'y' => '訂盟.納采.造車器.祭祀.祈福.出行.安香.修造.動土.上樑.開市.交易.立券.移徙.入宅.會親友.安機械.栽種.納畜.造屋.起基.安床.造畜椆栖.',
    'j' => '破土.安葬.行喪.開生墳.',
  ),
  'd1229' => 
  array (
    'y' => '祭祀.平治道塗.修墳.除服.成服.餘事勿取.',
    'j' => '移徙.入宅.嫁娶.掘井.安葬.',
  ),
  'd1230' => 
  array (
    'y' => '嫁娶.冠笄.祭祀.祈福.求嗣.彫刻.開光.安香.出行.入學.修造.動土.豎柱.上樑.造屋.起基.安門.出火.移徙.入宅.掘井.造畜椆栖.安葬.破土.除服.成服.',
    'j' => '開市.納采.訂盟.作灶.造廟.造船.經絡.',
  ),
  'd1231' => 
  array (
    'y' => '嫁娶.訂盟.納采.祭祀.祈福.求嗣.齋醮.安香.出火.修造.起基.造屋.合脊.安門.安碓磑.動土.上樑.移徙.入宅.',
    'j' => '出行.掘井.破土.行喪.安葬.',
  ),
  'd1131' => 
  array (
    'y' => '祭祀.沐浴.出行.餘事勿取.',
    'j' => '開市.動土.破土.行喪.安葬.',
  ),
)
?>