<!DOCTYPE html>
<html lang="zh-CN">
<head>
	<meta charset="UTF-8"/>
	<title>月老姻缘-八字综合详批-易读网</title>
	<meta name="viewport" content="width=device-width,initial-scale=1.0, minimum-scale=1.0, maximum-scale=1.0, user-scalable=no"/>
	<meta content="yes" name="apple-mobile-web-app-capable"/>
	<meta content="black" name="apple-mobile-web-app-status-bar-style"/>
	<meta content="telephone=no" name="format-detection"/>
	<link rel="shortcut icon" href="/statics/ffsm/favicon.ico"/>
	<link href="/statics/ffsm/bzyy/bzyy2.css" rel="stylesheet" type="text/css"/>
	<script src="https://apps.bdimg.com/libs/jquery/1.9.1/jquery.min.js"></script>
</head>
<body>
<img style="width:100%; height:auto; margin:0 auto; display:block;" src="/statics/ffsm/bzyy/images/bzyy_pay_banner.jpg" alt="点灯还愿">
<div class="container" id="topAnchor">
  <div class="wrapper" id="wrapper">
    <section id="page-result">
      <div data-reactroot="">
        <div>
          <div>
            <div class="li_title">个人信息</div>
            <ul class="user-info">
              <li>
                <div>姓名:<{$data.data.username}></div></li>
              <li>
                <div>性别:<{if $data.data.gender==1}>男<{else}>女<{/if}></div></li>
              <li>
                <div>公历:<{$data.data.y}>年<{$data.data.m}>月<{$data.data.d}>日 <{$data.data.h}>时</div></li>
            </ul>
          </div>
          <div class="minp">
            <div class="li_title_top"></div>
            <div class="li_title">您的八字命盘</div>
            <table class="minp-tab">
              <tbody>
                <tr>
                  <td></td>
                  <td>年柱</td>
                  <td>月柱</td>
                  <td>日柱</td>
                  <td>时柱</td></tr>
                <tr>
                  <td>十神</td>
                  <td><{$pp.shishen1}></td>
                  <td><{$pp.shishen2}></td>
                  <td><{$pp.shishen3}></td>
                  <td><{$pp.shishen4}></td></tr>
                <tr>
                  <td>天干</td>
                  <td><{$return.user.bazi.0}></td>
                  <td><{$return.user.bazi.2}></td>
                  <td><{$return.user.bazi.4}></td>
                  <td><{$return.user.bazi.6}></td></tr>
                <tr>
                  <td>地支</td>
                  <td><{$return.user.bazi.1}></td>
                  <td><{$return.user.bazi.3}></td>
                  <td><{$return.user.bazi.5}></td>
                  <td><{$return.user.bazi.7}></td></tr>
                <tr>
                  <td>藏干</td>
                  <td><{$pp.zanggan1}></td>
                  <td><{$pp.zanggan2}></td>
                  <td><{$pp.zanggan3}></td>
                  <td><{$pp.zanggan4}></td></tr>
                <tr>
                  <td>支神</td>
                  <td>伤官</td>
                  <td>食神
                    <br>偏财
                    <br>七杀</td>
                  <td>七杀
                    <br>伤官
                    <br>劫财</td>
                  <td>伤官</td></tr>
                <tr>
                  <td>纳音</td>
                  <td><{$pp.nayin1}></td>
                  <td><{$pp.nayin2}></td>
                  <td><{$pp.nayin3}></td>
                  <td><{$pp.nayin4}></td></tr>
              </tbody>
            </table>
          </div>
          <div>
            <div class="part">
              <div class="li_title_top"></div>
              <div class="li_title">八字情感婚姻</div>
              <div class="part_det">
                <p class="part_tips">财弱，代表您适合晚婚，不宜太早步入婚姻殿堂，否则容易对您的事业发展和家庭幸福有不利影响。</p>
                <p class="part_tips">日干支相战，代表您在婚姻方面容易遇到以下不顺的一种而为此烦恼：晚婚、多恋不成、婚后不睦、分居、外遇、离婚、婚后一方多病等。</p>
                <p class="part_tips">日支为七杀或偏印，代表您的妻子容易流产，需要多加小心。</p>
                <p class="part_tips">日支逢七杀，代表您的妻子比较强势，凡事都由您的妻子做主，或者您的妻子没有尽到自己的义务和责任。</p>
                <p class="part_tips">财星离日干远，代表您与异性关系不密切，她们对您的影响小，你们之间的缘分较浅，您也不容易结交异性朋友。</p>
                <p class="part_tips">您温良恭谦，性格稳重，但自尊心强，容易固执己见，您虽然崇尚浪漫纯洁的爱情，但您有很好的女人缘，比较容易朝三暮四，经常同时被不同的女性吸引，甚至因为花心而惹上桃花劫，需要小心被女人欺骗。您需要注意控制自己的欲望，否则容易败坏自己的家庭运，在婚姻中难以稳定下来。</p>
                <p class="part_tips">日支为辰戌丑未，代表您的妻子身材敦厚结实。</p></div>
            </div>
          </div>
          <div>
            <div class="part">
              <div class="li_title_top"></div>
              <div class="li_title">另一半相貌特征</div>
              <div class="part_det">
                <p class="part_tips">您肯定很好奇您的另一半长相，也曾经幻想过ta的样子。其实一切信息已经在您的八字中透露出来了。</p>
                <p class="part_tips">您的伴侣会是一个很有自我意识的人，虽不能算上自私，但对于自身的利益还是会考虑得比较重，给人的感觉较为成熟自立，能为您分担很多烦恼。但是，对方也是一个喜欢自由的人，讨厌条条框框约束自己，如果您像要死死克制住您的伴侣，那么感情生活难以美满。而对方很讨厌您的囉嗦，切记这样会令对方反感，引发不必要的矛盾。</p>
                <p class="part_tips">身高约162公分以上，骨架较大、体型挺拔。</p>
                <p class="part_tips">外貌来看，您的伴侣相貌较为一般，麵色红润有光泽，给人的感觉朴素、敦厚。</p>
                <p class="part_tips">以上就是您另一半的外貌特征，这样的人往往更容易获得您的好感。不过感情需要培养磨合，婚姻大事更需要慎重考虑，如果您已经有心仪的结婚对象，建议进行八字合婚配对来看看您与恋人是否真的合适。
                  <a href="/?ac=hehun">点击进行八字合婚</a></p>
              </div>
            </div>
          </div>
          <div>
            <div class="analysis">
              <div class="li_title_top"></div>
              <div class="li_title">婚配对象分析</div>
              <ul>
                <p>
                  <span class="ana_type">三合生肖：</span><{$return.data.xiyongshen.sanhe.sanhe.1}>、<{$return.data.xiyongshen.sanhe.sanhe.2}></p>
                <p>
                  <span class="ana_type">六合生肖：</span>狗</p>
                <p>
                  <span class="ana_type">相害生肖：</span><{$return.data.xiyongshen.sanhe.sanhe.1}></p>
                <p>
                  <span class="ana_type">相冲生肖：</span>鸡</p>
                <p>
                  <span class="ana_type">相刑生肖：</span><{$return.data.xiyongshen.sanhe.sanhe.2}></p>
                <p>
                  <span class="ana_type">婚配适宜：</span>猪、<{$return.data.xiyongshen.sanhe.sanhe.2}>、狗，
                  <span>相配大吉，天做良缘，互相扶持，财盛家宁。</span></p>
                <p>
                  <span class="ana_type">婚姻忌配：</span>鸡、<{$return.data.xiyongshen.sanhe.sanhe.1}>、鼠，
                  <span>吉凶各半，甘苦共存，无进取心，内心多忧疑苦惨。</span></p>
              </ul>
            </div>
          </div>
          <div>
            <div class="part">
              <div class="li_title_top"></div>
              <div class="li_title">TA会在什么时候出现</div>
              <div class="part_det">
                <p class="part_tips">如果现在您依旧单身，想知道何时才能遇到未来的另一半，您不得不关注自己的桃花年，因因为恋爱机会和桃花运息息相关。在走桃花运的年份，单身人士有更多机会与心仪的对象相遇、相爱。从八字来看，您未来10年的桃花运如下：</p>
                <p class="det_emp">
                  <span>恋爱桃花运非常好的年份：</span>2020年、2026年、2027年</p>
                <p class="det_emp">
                  <span>恋爱桃花运一般的年份：</span>2020年、2021年、2022年、2023年、2024年、2025年</p>
                <p class="det_emp">
                  <span>恋爱桃花运很差的年份：</span>无</p>
                <p class="part_tips">恋爱桃花运好的年份，您会觉得感情生活焕然一新，过往的不顺、伤感甚至会一扫而空。虽然不一定能马上喜事临门，但也会是春风得意的一年。当心仪的对象出现时，假如您能够把握住机遇，积极与对方接触，很有可能就能成就一段好姻缘。</p></div>
            </div>
          </div>
          <div>
            <div class="part">
              <div class="li_title_top"></div>
              <div class="li_title">适合结婚的年龄</div>
              <div class="part_det">
                <p class="part_tips">如果您和恋爱对象已经有了稳定的感情关系，那么何时结婚必然是您所关心的重要大事之一。从八字来看，您未来10年的结婚年运情况如下：</p>
                <p class="det_emp">
                  <span>结婚运非常好的年份：</span>2022年、2026年、2027年</p>
                <p class="det_emp">
                  <span>结婚运一般的年份：</span>2020年、2020年、2021年、2023年、2024年、2025年</p>
                <p class="det_emp">
                  <span>结婚运很差的年份：</span>无</p>
                <p class="part_tips">瓜熟蒂落、结婚成家是很自然的事，做好结婚计划对您未来的家庭和生活都有很好的帮助，老师认为只要不是结婚运很差的年份都可以考虑结婚。
                  <br>婚姻作为终身大事，很有必要进行合婚配对，了解自身和恋人的合婚情况，坦诚面对未来的关系发展，才能更好地处理夫妻之间的感情，令婚姻生活更加和谐美满。
                  <a href="/?ac=hehun">点击进行八字合婚</a></p>
              </div>
            </div>
          </div>
          <div>
            <div class="result_title">
              <div class="li_title_top"></div>
              <div class="li_title">2020爱情运势秘籍</div>
              <ul>
                <li>
                  <h3>单身的您：培养默契 加强共鸣</h3>
                  <p>您今年将有机会追求相貌姣好、事业心重的女性，对方擅交际、有主见，有很强的做事能力，但脾气火爆，心高气傲，容易专注于事业发展而忽略其他方面。在与对方的相处中，可能你们彼此都不够体贴细心，虽然聊天聊得开心，但还缺乏一些情感上的共鸣。需要注意除了掌握好和对方的相处距离之外，还需要注意加强精神层面上的交流，缩短彼此之间的距离。</p>
                </li>
                <li>
                  <h3>热恋的您：恋情动荡 身心俱疲</h3>
                  <p>今年如果您正在恋爱中，在感情方面会面临较多的波折和意外，从而阻碍、拖延你们之间感情的发展。在这段关系中容易出现第三者插足竞争的情况，导致恋情动荡、你们其中一方移情别恋甚至劳燕分飞。今年感情难以稳定，也难修成正果，您若深陷其中会心力交瘁，注意该及时脱身时则要果断。建议您可以选择与自己有一定年龄差距的异性，熬过感情挫折则可以迎来较顺利的发展，婚后也更容易美满幸福。</p>
                </li>
                <li>
                  <h3>已婚的您：小心破财 注意沟通</h3>
                  <p>今年您的妻子在财务方面会出现较大起伏，在投资买卖方面不慎出现破财的可能性较大。除了提示妻子注意风险、及时止损，您最好也做好两手准备以防不时之需。另外，您与妻子之间容易出现沟通问题，因为各执己见、互不相让而言语不和，让关系变得比较紧张。您若想更好地应对压力，应对妻子多加关心、理解，加强交流，学会换位思考。</p>
                </li>
                <li>
                  <h3>今年的桃花艳遇</h3>
                  <p>今年您的桃花艳遇在房宅，代表您会因房宅等不动产而获得桃花。因为现在很多人谈恋爱、选择对象的时候，都会观察对方有多少房产，如果家境好婚后可以减少烦恼。所以如果遇到自己的心仪对象，不妨展示自己的个人财力，带回家里坐坐，展现家人之爱，让对方了解您家人的互动和谐、家教优良、家族成员和善大方，对方可能因此而更加喜欢、认同您，让彼此的关系更上一层楼。</p>
                </li>
              </ul>
            </div>
          </div>
          <div>
            <div class="result_title">
              <div class="li_title_top"></div>
              <div class="li_title">2020桃花开运方法</div>
              <ul>
                <li>
                  <h3>脱离单身求桃花</h3>
                  <p>今年流年桃花位在西北方位，想要脱单的话最紧要的是催旺这个方位，加强桃花运。家中床头或公司中自己的办公桌位于西北方位对自己的桃花较有利。在这个桃花星飞临之处除了摆放鲜花之外，也可以放上粉红水晶、红纹石、红色丝带做成的花或蝴蝶等摆设，既可以点缀家居工作环境，又能给自己带来好姻缘。不过切忌在西北方位放置过多黑色或深色物品，装饰也不宜采用这些颜色，因为这些是灰暗的颜色，不利于求桃花。</p>
                </li>
                <li>
                  <h3>提升感情甜蜜度</h3>
                  <p>情侣和夫妇今年若想保持关系融洽，增进感情，就要小心今年流年的是非星了。今年的是非星降临东北方位，忌讳在这个方位见到任何绿色的物品或装饰，特别是睡房处于东北方位时更要小心地避忌，否则天天吵架就麻烦了！补救方法是在东北方位多摆放红色物品来改善关系，亦可以插九枝去掉刺的玫瑰来抵御是非星的力量。</p>
                </li>
                <li>
                  <h3>结婚添丁多喜事</h3>
                  <p>今年的喜庆位在中宫，即房子的中央位置。喜庆位代表一切喜事，催旺这个方位能够带来喜事，尤其有利于嫁娶和生儿育女。今年打算结婚或生小孩的朋友可以在家中的中宫放置红色、绿色的物品，或是带果实的盆栽。而想要结婚的情侣还可以在中宫放置鸳鸯摆设或两个一模一样的公仔催旺姻缘。</p>
                </li>
                <li>
                  <h3>改善人缘利发展</h3>
                  <p>桃花不仅代表感情也代表人缘，改善人际关系可以改善西北方位的风水，因为今年的桃花星降临西北方。可以在该方位放置水培植物加强人际关系，这个方位上的颜色越鲜艳则越有利。在办公室的话，不妨在桌面的西北方位放置小盆的水培植物。</p>
                </li>
                <li>
                  <h3>二人感情求稳定</h3>
                  <p>如果你担忧自己的另一半在外桃花太多，怕对方变心，可以削弱家中流年桃花位的影响，无论是未婚还是已婚，均可以在家中的西北方位摆放木质的公鸡饰物，减弱桃花星的力量。但切忌放置空花瓶，以防惹来烂桃花。但从事公关、营销、娱乐业等行业的朋友需要小心化桃花带来的负面影响，因为桃花也是人缘，化桃花会影响人际关系，所以需谨慎考虑。</p>
                </li>
              </ul>
            </div>
          </div>
          <div>
            <div class="result_title">
              <div class="li_title_top"></div>
              <div class="li_title">2020风水开运方法</div>
              <ul>
                <li>
                  <h3>找对靠山保饭碗</h3>
                  <p>上班族今年如果先要避开裁员危险，就要特别注意自己在办公室的座位是否会出现缺乏“靠山”（背后没有靠墙或高大的柜子遮挡）的情况，如果是这种情况则容易被煞气所冲、削弱运势，若加高椅背或摆放八个石春（一种白色石头）则可以改善运势。另外家中风水也要注意，例如沙发应该靠墙或柜子这种高大稳固的物体，否则也是“缺乏靠山”的情况。</p>
                </li>
                <li>
                  <h3>升职加薪两不误</h3>
                  <p>今年如果想要在职场上更上一层楼、升职加薪，就要注意催旺家中和办公室文昌星及财星的位置啦。今年的文昌星在正南方位，可以将水培富贵竹四枝置于该方位提高职场运势。今年的八白财星在东南方位，放置有谁的摆设或者红黄二色物品可以催旺财运，有利于加薪。</p>
                </li>
                <li>
                  <h3>生意兴隆财运来</h3>
                  <p>个体户或者公司老板今年想要生意兴隆，可以通过当旺的财星位置来催旺财运。今年八白财星位置在东南方，可以摆放水培植物带动财气。在店铺或办公室门口朝外摆放一对貔貅可以起到招财的作用，收银机或保险柜上下左右接触的位置则可以摆放聚宝盆这样的风水摆件守住钱财。</p>
                </li>
                <li>
                  <h3>小人是非要远离</h3>
                  <p>今年若想防住小人、减少是非，最忌在东北方位上动土，因为今年的东北方位有是非星降临，若想要减弱是非星的力量，则应在此方位上摆放红色物品，或者黑曜石水晶摆件。</p>
                </li>
                <li>
                  <h3>身体健康离病灾</h3>
                  <p>今年的正北和正西方位分别为五黄灾星和二黑病星位，对健康都会造成不利影响，其中五黄的影响最大。需要注意家中的沙发、床以及公司中办公桌的座位是否处于这两个方向，长期在这些位置坐卧会容易生病。若要提升健康运则应避免在正北和正西方位动土，亦不宜摆放红黄二色的物品，可以防止铜制或者金色的重物化解霉运。</p>
                </li>
              </ul>
            </div>
          </div>
          <div>
            <div class="result_title">
              <div class="li_title_top"></div>
              <div class="li_title">2020化太岁方法</div>
              <ul>
                <li>
                  <h3>犯太岁如何自救？</h3>
                  <p>坊间流传很多关于犯太岁的说法，其中很大部分都夸大了犯太岁的严重性。一般来说，犯太岁的这一年代表生活中波动大，情绪也容易跟着起伏不定，但不一定就意味着倒霉、运气差。有一部分人甚至在犯太岁时交好运，若是从事经常出外的工作或者常与他人打交道的工作，在外劳碌奔波反而会因犯太岁而得利，取得明显突破。犯太岁亦可认为是踏进人生的新阶段，人生变动难免会带来担忧和恐惧，若能够做好相应的心理准备，谋事在人、成事在天，以积极的态度主动迎接变化，心态好反而有助于应对各种挑战，更加靠近自己的目标。</p>
                  <p>犯太岁为民间对本命年太岁、冲太岁、害太岁、刑太岁等的统称，影响轻重不一，大家若遇上犯太岁的年份，只要做好心理准备，通过行动去积极化解，就不必过分担忧。</p>
                  <!-- react-text: 248 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>2020年（庚子鼠年）犯太岁的生肖</h3>
                  <p>2020年（庚子鼠年）犯太岁的生肖包括：鼠、马、羊、兔。</p>
                  <!-- react-text: 252 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>鼠 犯本命年太岁</h3>
                  <p>本命年犯太岁的生肖，生活多有变动，但这些变动是好是坏需要看个人的具体命造，但本命年犯太岁有共同的特点，就是容易胡思乱想，情绪起伏大，容易影响到决策，所以需要注意忙中抽空休养身心，适当放松、释放压力。本命年犯太岁，最适宜举办喜事，包括结婚生子、创业转职、乔迁新居等，可以化凶为吉。</p>
                  <p>另外，本命年犯太岁需要注意的还有健康和安全，轻则磕磕碰碰，重则易有血光之灾，所以日常生活应多注意安全，尽量避免参加有风险的活动，同时还可以通过捐血、洗牙等来化解。</p>
                  <!-- react-text: 257 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>马 冲太岁</h3>
                  <p>在各种犯太岁的类型中，属冲太岁的影响变化最大，容易在这一年发生各种人生大事，例如换工作、置业、搬迁、结婚、离婚等，其中感情关系最受影响。很多人在冲太岁时刚好遇到感情方面的挑战，如果不积极应对，则可能会有不少挫折。</p>
                  <p>例如单身者在冲太岁时有机会脱单，不过感情来得快也去得快，难有稳定发展，因此冲太岁之年建立的恋爱关系还是应谨慎，保持观望态度较好。有伴侣的朋友则需要注意，若没有计划结婚或者生儿育女，感情在冲太岁之年容易出现重大冲击，感情关系遭受巨大考验，多有波折，甚至严重者会分手、离婚。因此在冲太岁之年宜采取积极行动化解，比如订婚、结婚、添丁或者聚少离多都有利于关系保持稳定。</p>
                  <!-- react-text: 262 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>羊 刑太岁+破太岁</h3>
                  <p>刑太岁，代表这一年遇上轻微麻烦和是非的几率较大，因此影响到人际关系。为了避免是非，影响到自己的生活和情绪，宜行事谨慎，做事低调。破太岁则有破坏之意，代表一些稳固的人际关系容易遭受破坏，甚至严重者会与人反目成仇。虽然其破坏力有限，仍然会影响到运势。同时刑、破太岁，日常生活多有人际方面的困扰，危害不至于太严重，但还是会让自己心烦，所以最好能够注意谨言慎行，避免祸从口出，给自己徒增烦恼。</p>
                  <!-- react-text: 266 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>兔 刑太岁</h3>
                  <p>刑太岁，代表这一年遇上轻微麻烦和是非的几率较大，因此影响到人际关系。为了避免是非，影响到自己的生活和情绪，宜行事谨慎，做事低调。</p>
                  <!-- react-text: 270 -->
                  <!-- /react-text --></li>
                  <h3>化太岁大法</h3>
                  <p>
                    <!-- react-text: 278 -->若自己所属的生肖属于犯太岁的生肖，不必太过慌张，我们的祖先已经总结出一套非常有用的化太岁方法，只要诚心执行，则能够平安度过犯太岁的年份。
                    <!-- /react-text --></p>
                  <!-- react-text: 279 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>一、冲喜</h3>
                  <p>化解太岁最常用的方法之一，当属“冲喜”了，坊间亦常流行冲喜的说法。古人常说“太岁当头坐，无喜必有祸”，但“一喜挡三灾”，说明冲喜的传统自古就有。虽然犯太岁多数时候并不至于称得上“灾祸”，生活上多有波折摩擦而已，但“人逢喜事精神爽”，若能在犯太岁之年举办喜事，的确可以将这一年的坏影响降至最低。</p>
                  <p>用于化解太岁的喜事以结婚、生儿育女、置业为最佳，但这些人生大事很难刚巧在这一年发生，但仍有其他喜事可以作为化解方法，比如结拜兄弟、参加寿宴婚宴等来冲喜，出席其他喜庆活动、多吃喜庆食物（如喜糖、喜饼等）也可以提升一些运势。另外还需要注意的是，犯太岁者应尽量避免探病、参加丧事。</p>
                  <!-- react-text: 284 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>二、小心部署计划</h3>
                  <p>犯太岁代表变动增多，其中包括搬迁、转职、较大规模的投资（比如生意上的变动或扩张业务）等。变动的走向虽然未知好坏，但人定胜天，若能够做好详尽计划和周全准备，随机应变，心态平和，则能减少不必要的困扰。</p>
                  <!-- react-text: 288 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>三、佩戴生肖饰品</h3>
                  <p>犯太岁的人传统上亦会佩戴相应的生肖饰品化解煞气，所有生肖都适宜佩戴玉器，另外春夏季节出生的朋友还可以选择金银材质的饰品，但秋冬出生的朋友就不推荐金银材质了，仍是佩戴玉器为最佳。</p>
                  <!-- react-text: 292 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>2020鼠年 犯太岁生肖饰品选择指南</h3>
                  <p>猪：宜贴身佩戴兔形之饰物</p>
                  <p>猴：宜贴身佩戴鼠形及猴形之饰物</p>
                  <p>蛇：宜贴身佩戴马形之饰物</p>
                  <p>虎：宜贴身佩戴鼠形之饰物</p>
                  <!-- react-text: 300 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>如何选择化太岁的生肖饰品</h3>
                  <p>每年的化太岁生肖饰品并不完全相同，一般化太岁都要根据每一个生肖的六合或三合生肖来计算，给每一生肖带来助力的生肖都不止一个，所以每年的化太岁生肖不太一样。</p>
                  <p>十二生肖为事儿地支的代表，中国古代的年份代号均由十天干和十二地支两两组合而成，共有六十个组合。例如2016年的丙申年、2017年的丁酉年，其中“申”“酉”为地支，“丙”“丁”为天干。</p>
                  <p>因为地支的力量在一般情况下比天干强，所以每一年的地支更受重视。不过十二地支的名称和意义较难理解，不便于流传，因此古人便为十二地支分别配上十二种动物，才出现了民间流传甚广的十二生肖。生肖饰品的宜忌搭配，其实就是十二地支的有利组合，也就是下面所说的“六合”与“三合”。</p>
                  <img src="/statics/ffsm/bzyy/images/tian_gan_di_zhi.png" alt=""></li>
                <li>
                  <h3>生肖的六合与三合</h3>
                  <p>简单说来，“六合”就是把十二生肖分成六组，每组两个生肖互为贵人，“三合”则把十二生肖分成四组，每组生肖欣赏和包容同组的另外两个生肖。与三合比起来，六合生肖之间互助的力量较大，所以一般采用六合的生肖来化煞。</p>
                  <p>六合中每组只有两个生肖，不是你帮我就是我帮你，但每年都有几个生肖犯太岁，如果恰逢同一组中的两个生肖都犯太岁，双方都自身难保，更别说顾及对方了，这种情况下就要从三合生肖中寻找对自己有助力的生肖。同理，若同一组三合生肖中有犯太岁的，也无法给自己所属的生肖化煞。</p>
                  <p>下表列出了十二生肖的六合与三合配对，基本上年年适用，不过今年为戊戌狗年，猪、猴、蛇、虎在本年都犯太岁，所以以x标示，其余生肖可以首选六合，三合亦可以。</p>
                  <!-- react-text: 312 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>2020鼠年化太岁生肖饰品一览表</h3>
                  <p>（X：今年不可选择，只作参考）</p>
                  <img src="/statics/ffsm/bzyy/images/tai_sui_shi_wu.png" alt=""></li>
                <li>
                  <h3>四、拜太岁</h3>
                  <p>拜太岁也是常见的化煞方法，方法可繁可简，下面列举出来的是必要步骤。一般拜太岁可以大致分为三种：</p>
                  <!-- react-text: 320 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>1、前往大寺庙拜太岁</h3>
                  <p>很多寺庙都供奉了太岁，较出名的有上海的城隍庙，香港荃湾的圆玄学院等，想去寺院拜太岁的朋友可以在网络上查询自己所在城市有哪些寺庙提供参拜。和小寺庙祭拜的方法不太一样，大寺庙拜祭流程更加讲究，具体步骤如下（各地具体流程可能根据寺庙有所不同，仅供参考）：</p>
                  <p>（1）先准备好太岁疏文（可以在庙外或网上购买），将自己的姓名、年龄、出生日期写上去。</p>
                  <p>（2）首先给六十太岁的统领上香。</p>
                  <p>（3）给当年太岁上香，2020庚子鼠年的太岁为“姜武”，心中默念“戊戌太岁姜武大将军，望将军庇佑弟子今年逢凶化吉，好运常来，身体健康（可加上自己希望的其他愿望），年底定当诚心酬谢。”</p>
                  <p>（4）再查询自己出生年所属的太岁，给出生年的太岁上香。</p>
                  <p>（5）逐一给其余太岁上香。</p>
                  <p>（6）最后将太岁疏文焚化。注意焚化疏文要从文首开始，最后才焚化结尾部分。</p>
                  <!-- react-text: 330 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>2、前往小寺庙拜太岁</h3>
                  <p>小寺庙通常会将六十位太岁放在一起，所以祭拜的方式相对比大寺庙简单许多，具体步骤如下（各地具体流程可能根据寺庙有所不同，仅供参考）：</p>
                  <p>（1）先准备好太岁疏文（可以在庙外或网上购买），将自己的姓名、年龄、出生日期写上去。</p>
                  <p>（2）给庙里的太岁上香，心中默念“戊戌太岁姜武大将军，望将军庇佑弟子今年逢凶化吉，好运常来，身体健康（可加上自己希望的其他愿望），年底定当诚心酬谢。”</p>
                  <p>（3）最后将太岁疏文焚化。注意焚化疏文要从文首开始，最后才焚化结尾部分。</p>
                  <!-- react-text: 337 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>3、家中自行祭拜</h3>
                  <p>若不想前往寺庙祭拜，在家中也可以拜太岁，步骤如下：</p>
                  <p>（1）在红纸上写下当年太岁资料，比如今年应写上“戊戌年当年太岁之位”或“戊戌年姜武太岁位”。</p>
                  <p>（2）将红纸放于家中大神（如观音、关帝）旁边。家中若没有设神位，则可以安置在位于西北太岁方的供桌上。</p>
                  <p>（3）用香三支、烛两支、斋菜和六种水果供奉，诚心参拜，默念“戊戌太岁姜武大将军，望将军庇佑弟子今年逢凶化吉，好运常来，身体健康（可加上自己希望的其他愿望），年底定当诚心酬谢。”</p>
                  <p>（4）将红纸、太岁疏文焚化。疏文从文首开始焚化，最后焚化结尾的部分。</p>
                  <p>无论使用哪种方法，只要诚心，太岁就会保佑一年平安。适合拜太岁的日子可以参考黄历中的狗年吉日、吉时，准备供奉的物品只需香烛和水果，不需要肉等荤菜。</p>
                  <p>拜太岁之后要记得在年底“还太岁”，酬谢神明一年来的保佑。还太岁最好选在每年的冬至之前，即公历的12月22日或23日，方法跟一般的还愿步骤一样，只需要准备简单的水果和香烛即可。</p>
                  <!-- react-text: 347 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>五、趋吉避凶</h3>
                  <p>没有犯太岁的朋友若在运势预测中得知流年运势不佳，亦有方法可以趋吉避凶。</p>
                  <!-- react-text: 351 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>（1）化血光之灾：捐血或放生</h3>
                  <p>如果流年运势有容易受伤的迹象，甚至是血光之灾，除了捐血来化解，还可以通过主动去做全身检查、洗牙补牙去“应劫”。也可以进行放生活动，用福德来减少运势的负面冲击，但注意放生应注意不要好心做坏事，最好选择市场上即将成为“刀下亡魂”的家禽或海鲜，注意不能随意放生外来物种破坏生态平衡，也要留意放生地点是否恰当。</p>
                  <p>另外需要注意避免参加危险的活动，平时注意交通安全，开车的朋友小心不要开快车，生活上需比平日更加小心谨慎，不妨给自己买一份保险。</p>
                  <!-- react-text: 356 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>（2）化白事：施棺或赠药</h3>
                  <p>如果流年家运不顺，甚至有白事（丧葬）之象，适宜通过“施棺”或赠送医药来稳定家运。“施棺”的意思是向家中有人过世的贫苦人家捐赠丧葬费或向死者家属提供生活上的帮助，这种善举是莫大功德，利人利己，也可以帮助化解家中的白事。</p>
                  <p>此外，主动向生病的贫苦人家赠送医药也是积福的举动。不妨直接捐款给非盈利组织用于公益医疗，资助贫苦大众改善医疗条件，不但可以助人，还可以提高健康运势和家运。</p>
                  <!-- react-text: 361 -->
                  <!-- /react-text --></li>
                <li>
                  <h3>佩戴开运饰品：百解手绳或挂饰</h3>
                  <p>流年若不是犯太岁的生肖，但仍想要借助开运饰品来提升整体运势的朋友，可以选择百解手绳或者挂饰。</p>
                  <p>“百解”是中国灵兽之一，玄学上用于镇宅化煞，招福纳财。百解吉祥物人人适用，与其他开运饰品不会相冲，长期佩戴可以消灾解困，保佑出入平安。</p>
                  <p>但凡流年开运或者化太岁的饰物，都是用于化煞挡灾，只适合在当年使用，不宜年年佩戴同一吉祥物。在丢弃前应先将红纸或红包袋包好，为过去一年得到的保佑表达谢意。新年的开运吉祥物也应妥善保存，出现损坏的情况应及早更换。</p>
                  <!-- react-text: 367 -->
                  <!-- /react-text --></li>
              </ul>
            </div>
          </div>
          <div class="go-top-btn" id="go-top-btn" style="display: block;">
            <a href="#topAnchor"><img src="/statics/ffsm/bzyy/images/go_top.png" alt="回到顶部"></a></div>
        </div>
      </div>
    </section>
  </div>
</div>
<div class="ainuo_foot_nav cl" id="testFixedBtn">
    <ul>
     <li><a href="/"><i class="shouye_1"></i><p>测算首页</p></a></li>
     <li><a href="/?ac=history"><i class="wddd_1"></i><p>订单查询</p></a></li>
     <li><a href="/"class="botpost"><em><i class="lijics_1"></i></em><p>继续测算</p></a></li>
     <li><a href="/"><i class="gengduo_1"></i><p>更多测算</p></a></li>
     <li><a href="/?ac=member"><i class="grzx_1"></i><p>个人中心</p></a></li>
    </ul>
</div>
<style type="text/css">
.ainuo_foot_nav{display: block; padding: 2px 0; background:#dab58b; position: fixed; bottom: 0; width: 100%; z-index: 99999;max-width:720px;}
.ainuo_foot_nav ul{margin: 0;padding: 0;}
.ainuo_foot_nav li{width: 20%; text-align: center; float: left;}
.ainuo_foot_nav li a{width: 100%; display: block;}
.ainuo_foot_nav .foothover i{color: #f13030;}
.ainuo_foot_nav li i{display: block; line-height: 25px; height: 25px; margin: auto; padding: 0; width: 25px; overflow: hidden; background-size: 100%;}
.ainuo_foot_nav li a.botpost{position: relative; margin-top: -11px; background-color: rgba(0,0,0,0.0);}
.ainuo_foot_nav li a.botpost em{background: #ffffff; padding: 2px; border: 1px solid #ff5e5e; display: block; border-radius: 50%; width: 30px; height: 30px; margin: 0 auto; margin-bottom: 2px;padding-bottom: 0px;}
.ainuo_foot_nav li p{overflow: hidden; font-size: 12px; height: 16px; line-height: 16px; color: #fff; font-weight: 400;margin: 0;padding: 0;}
.shouye_1{background: url(/statics/ffsm/public/images/shouye.png) no-repeat;}
.wddd_1{background: url(/statics/ffsm/public/images/dingdan.png) no-repeat;}
.lijics_1{background: url(/statics/ffsm/public/images/suan.png) no-repeat;}
.gengduo_1{background: url(/statics/ffsm/public/images/gengduo.png) no-repeat;}
.grzx_1{background: url(/statics/ffsm/public/images/grzx.png) no-repeat;}
</style>
<br><br><br><br>
<{include file='./ffsm/dl_ck.tpl'}>
</body>
</html>