<?php

	$arr=$cookies;

	$name=$arr["xingming"]["xing"].$arr["xingming"]["xing"];

	$y=$arr['nianling']["y"];

	$m=$arr['nianling']["m"];

	$d=$arr['nianling']["d"];

	$h=$arr['nianling']["h"];

	$i=$arr['nianling']["i"];

	$term1=$arr['jieqi']["term1"];

	$term2=$arr['jieqi']["term2"];

	$sex=$arr["sex"];

	$start_term=$arr["start_term"];

	$end_term=$arr["end_term"];

	$start_term1=$arr["start_term1"];

	$end_term1=$arr["end_term1"];

	$cY=$arr["cY"];

	$cM=$arr["cM"];

	$cD=$arr["cD"];

	$cH=$arr["cH"];

	$lDate=$arr["lDate"];

	
    
	//获取session数据

	$wh1=$arr['wh'][0];

	$wh2=$arr['wh'][1];

	$wh3=$arr['wh'][2];

	$wh4=$arr['wh'][3];

	$wh5=$arr['wh'][4];

	$wh6=$arr['wh'][5];

	$wh7=$arr['wh'][6];

	$wh8=$arr['wh'][7];

	

	$bazi=$arr['bazi'];

	$bazi1=$arr['bazi'][0];

	$bazi2=$arr['bazi'][1];

	$bazi3=$arr['bazi'][2];

	$bazi4=$arr['bazi'][3];

	$bazi5=$arr['bazi'][4];

	$bazi6=$arr['bazi'][5];

	$bazi7=$arr['bazi'][6];

	$bazi8=$arr['bazi'][7];

	

	$y=$arr['nianling']['y'];

	$m=$arr['nianling']['m'];

	$d=$arr['nianling']['d'];

	$h=$arr['nianling']['h'];

	$i=$arr['nianling']['i'];

	$term1=$arr['jieqi']['term1'];

	$term2=$arr['jieqi']['term2'];

	

	$jiuliy=$arr['jiuli']['y'];

	

	$jiulim=$arr['jiuli']['m'];

	

	$jiulid=$arr['jiuli']['d'];

	

	$jiulih=$arr['jiuli']['h'];

	

	

	$name=$arr['xingming']['xing'].$arr['xingming']['ming'];

	//--end>

	

	/**

	 *数组

	 */

$zgao[0]='1、四柱喜木，有利的方位是东方（以父出生地为基准），不利西方，西南；其人喜绿色，不利白色，喜居住坐东朝西的房子，床的放置东西向，床头在东，房间里适宜摆放绿色植物。<br><br style=line-height=50%>

2、取名用字五行属木的有利。<br><br style=line-height=50%>

3、四柱喜木，应从事与木有关的事业或职业为宜，文学、文艺、文具店、文化事业的文人，教育界、书店、出版社、公务界、司法界、治安警界、官途之界、政治界、新创设计、特殊动植物生长界之学者、植物载种试验界。<br><br style=line-height=50%>

木材、木器、木制品、家俱、装璜、纸界、竹界、种植界、花界、树苗界、青果商、草界、药物界（开药房或药剂师）、医疗界。<br><br style=line-height=50%>

培育人才界、布匹买卖界、售敬神物品或香料界、宗教应用物界、宗教家之事业、或售卖植物性之素食品，以上均属木之事业。<br><br style=line-height=50%>

4、事业发展利东、东北，不利西、西南。<br><br style=line-height=50%>

5、吉祥数字为: 1 2 <br><br style=line-height=50%>

6、吉利楼层末位数为：3 8<br>';

$zgao[1]='1、四柱喜火，有利的方位是南方（以父出生地为基准），不利北方，西北；其人喜红色，不利黑色，喜居住坐南朝北的房子，床的放置南北向，床头在南。<br><br style=line-height=50%>

2、取名用字五行属火的有利。<br><br style=line-height=50%>

3、四柱喜火，应从事与火有关的事业或职业为宜，热度性质、火爆性质、光线性质、加工修理性质、做工性质、易燃性质、手工艺性质、一切人身装饰物性质，均属之。<br><br style=line-height=50%>

放光、照光、照明、光学、高热、液热、易燃烧物。或油类界、酒类界、热饮食界、食品界、手工艺口、机械加工品。工厂、制造厂、衣帽行、理发馆、化学界、油漆橡胶、一切人生装饰物品。<br><br style=line-height=50%>

军界、歌舞艺术（以人对人之事业）、百货行、印刷业、雕刻师、评论家、心理学家、演说家均属之。<br><br style=line-height=50%>

4、事业发展利南、东南，不利北、西北。<br><br style=line-height=50%>

5、吉祥数字为:  3 4 <br><br style=line-height=50%>

6、吉利楼层末位数为：2 7<br>';

$zgao[2]='1、四柱喜土，有利的方位是本地、南方（以父出生地为基准），不利北方，东北；其人喜红色，黄色，不利绿色，黑色，喜居住坐南朝北的房子，床的放置南北向，床头在南。<br><br style=line-height=50%>

2、取名用字五行属土的有利。<br><br style=line-height=50%>

3、四柱喜土，应从事与土有关的事业或职业为宜，土产或地产性质、农作性质、畜牧性质、大自然原物性质、中间人性质，又因土最卑下，最中央，故领导性质、人才事业、防水事业均属之。<br><br style=line-height=50%>

农人或土壤研究者、售现成菜业、售现成农作物（杂谷、米、麦等），畜牧兽类（如物牛羊或养鸡猪……等），售饲料界、所有农畜界百业。大自然原物售卖界{即石、石灰、土地（包括山地、水泥……等）}。建筑界、房地产买卖业、房屋买卖业。土是克水之物，故而防水事业（即雨衣、雨伞、雨帆、筑堤防……窖水物器……等）也是。<br><br style=line-height=50%>

当铺、古董家、鉴定师、所有中介、介绍业，及代书、律师、说客、法官、代理、管理。代替、买卖、设计、顾问、秘书、附属品、附属人均是（而土附火而生）。<br><br style=line-height=50%>

又领导事业（即高级官或职），及使人讨厌的事业（如殡葬等），又零碎整理事业：如书记、簿记、记录员、会计师也属之。<br><br style=line-height=50%>

4、事业发展利中南，不利东北。<br><br style=line-height=50%>

5、吉祥数字为: 5 6 <br><br style=line-height=50%>

6、吉利楼层末位数为：0 5 <br>';

$zgao[3]='1、四柱喜金,有利的方位是西方（以父出生地为基准），不利南方，东南；其人喜白色，不利红色，喜居住坐西朝东的房子，床的放置东西向，床头在西。<br><br style=line-height=50%>

2、取名用字五行属金的有利。<br><br style=line-height=50%>

3、四柱喜金，应从事与金有关的事业或职业为宜，如经营五金器材，粗铁材或金属工具材料等方面事业，坚硬事业、决断事业、主动别人性质的事业，一切武术家、鉴定师（评估师）、拍卖人员、法官、执法人员、总主宰、汽车界、交通界、金融界、工程业、科学界、武术家、开矿界、民意代表、珠宝界、伐木事业。<br><br style=line-height=50%>

4、事业发展利西、中西, 不利南、东南。<br><br style=line-height=50%>

5、吉祥数字为: 7 8 <br><br style=line-height=50%>

6、吉利楼层末位数为：4 9<br>';

$zgao[4]='
1、四柱喜水，有利的方位是北方（以父出生地为基准），不利南方，中南；其人喜黑色，不利黄色，喜居住坐北朝南的房子，床的放置南北向，床头在北。<br><br style=line-height=50%>

2、取名用字五行属水的有利。<br><br style=line-height=50%>

3、四柱喜水, 应从事与水有关的事业或职业为宜, 如外勤职务, 奔波流动性事业, 制冰, 冷藏, 行海, 旅游, 运动家, 记者, 旅社等。 事业发展利北、西北, 不利中南。<br><br style=line-height=50%>

4、吉祥数字为: 0 9 <br><br style=line-height=50%>

5、吉利楼层末位数为：1 6 <br>';

	 

	 

$yq[0][0]="<p>流水有情归故润，夕阳无话下空亭。</p><p>冲财，生风波，防财物丢失。</p>";

$yq[0][1]="<p>东风有意添杨柳，西雨无情损海棠。</p><p>平运，守旧业，青年时代有同胞好坏事牵涉本人财帛。</p>";

$yq[0][2]="<p>好似晓云初出岫，恰为江日正东升。</p><p>财运好，威信高，家庭好事，守旧业则顺利。</p>";

$yq[0][3]="<p>分明似喜非为喜，恍惚闻香不是香。</p><p>防小人暗算，运气一般。</p>";

$yq[0][4]="<p>谩谓碧桃开笑口，须知缘柳带愁根。</p><p>威信高，有财气，有购置建设好事，但好事中有小阻或口舌。女性益夫。</p>";

$yq[0][5]="<p>顺风江上满扬帆，不料江头有石滩。</p><p>防与人发生纠纷，较操心，不可远方求财，驾车谨慎，夜勿远走。</p>";

$yq[0][6]="<p>分明月在梅枝上，寻到梅边月又无。</p><p>操心浮动，冲财口舌，官场交际防官非或冲长辈。</p>";

$yq[0][7]="<p>花开月朗风光好，人乐家安喜气浓。</p><p>福从天来，合想得财，顺利，录用提升。</p>";

$yq[0][8]="<p>云深樵子迷归路，水大渔翁失钓机。</p><p>有得有失，财运一般，谨防耗财。</p>";

$yq[0][9]="<p>乌江水亦鸣孤愤，蜀道山多带不平。</p><p>财运好，收入高，可发展，但要防得后复失。男性益妻。</p>";

$yq[1][0]="<p>路逢蜀道多经险，水入黄河便不清。</p><p>财运差，生挫折，身体欠健康，注意财物丢失。</p>";

$yq[1][1]="<p>千里风云培玉树，十分雨露发荆花。</p><p>平运，有小财源，益同胞之运。</p>";

$yq[1][2]="<p>人逢春事精神爽，月到中天分外明。</p><p>威信高，有财气，家庭好事。</p>";

$yq[1][3]="<p>荒江叶乱露初冷，独棹孤舟夜上流。</p><p>办事小心，防小人，财源一般。</p>";

$yq[1][4]="<p>雷鸣大地声千里，霞绕青山色万重。</p><p>有威信，有财气，购置建设好事。女性益夫。</p>";

$yq[1][5]="<p>夜雨无情惊醒梦，西风有意折飞花。</p><p>生口舌，操心，不可远方求财，驾车谨慎，夜勿远走。</p>";

$yq[1][6]="<p>夜色似年难得晓，灯光如豆不成红。</p><p>操心浮动，防与人发生纠纷，官场交际防官非，冲长辈与长辈不和。</p>";

$yq[1][7]="<p>支收自然星月朗，春回依旧草花香。</p><p>福从天来，合想得财，较顺利，录用提升，公务员吉。</p>";

$yq[1][8]="<p>昨夜不知何处雨。今朝花木损精神。</p><p>有得有失，做生意者经营不可大，或以工取财可也，谨防耗财。</p>";

$yq[1][9]="<p>梅知运到添春色，鸟觉时来报好音。</p><p>有财气，收入高，大有发展。男性益妻。</p>";

$yq[2][0]="<p>夫妻本是同林鸟，宿在林中离去先。</p><p>平运，财怕劫神勿远道求财，宜守旧业可也。</p>";

$yq[2][1]="<p>后运正兴家业盛，光风齐月乐悠悠。</p><p>平安平稳，财源一般。益同胞之运。</p>";

$yq[2][2]="<p>口念弥陀不脱尘，在家修道敬鬼神。</p><p>收入高，有购置好事，但须防破失，守旧业为好。</p>";

$yq[2][3]="<p>风漾柳枝无气力，淡时月影未分明。</p><p>防小人暗算，不可赌博，守为吉。</p>";

$yq[2][4]="<p>好似花开当午日，犹如嫩柳遇春风。</p><p>一航风顺，财源广进。女性益夫。</p>";

$yq[2][5]="<p>文质彬彬君子志，趋庭诗礼习儒宗。</p><p>生风波，不可远方求财，驾车谨慎，夜勿远走。</p>";

$yq[2][6]="<p>维持屋里春风满，织锦机中夜月寒。</p><p>工作生阻，冲财及冲长辈体差，官场交际防官非。</p>";

$yq[2][7]="<p>财源交接声名重，家业兴隆气象新。</p><p>心想事成，一航风顺，录用提升之运。</p>";

$yq[2][8]="<p>东西南北皆亨通，往来有利得相从。</p><p>忌远道求财，守旧业可也，平运。</p>";

$yq[2][9]="<p>花放随风情切切，水流叶落恨汪汪。</p><p>谋事能就，收入高，财源亨通。男性益妻。</p>";

$yq[3][0]="<p>花开遇雨无颜色，月明偶被黑云遮。</p><p>冲财体差，宜守旧业，办事生挫折。</p>";

$yq[3][1]="<p>终日持竿不得鱼，江中风雨草萋萋。</p><p>平运，财源一般，青年时代有同胞好坏事牵涉本人财帛。</p>";

$yq[3][2]="<p>风弄竹声惊犬吠，月移花影惹鸡鸟。</p><p>工作顺利，财运通，有购置建设等好事。</p>";

$yq[3][3]="<p>风出不堪云淡淡，花开无奈雨淋淋。</p><p>小伤威信，忌赌，守为吉。</p>";

$yq[3][4]="<p>风吹翠竹流珠泪，雪压梅花带素冠。</p><p>贵人扶持，有购置建设等好事，但好事中有小阻。女性益夫。</p>";

$yq[3][5]="<p>当年之曲不堪闻，弹出新声另有声。</p><p>运阻滞，防与人发生纠纷，不可远道求财。</p>";

$yq[3][6]="<p>虚名虚利而不成，浪足迹萍踪已半生</p><p>。财运不通，对长辈不利或防官非，不可远道求财。。</p>";

$yq[3][7]="<p>走过江山又是关，道途跋涉事艰难。</p><p>有贵人扶持，收入高，工作顺序。</p>";

$yq[3][8]="<p>处处鸡鸟两分飞，拆断佳人不济眉。</p><p>防财物丢失，收入一般，平运。</p>";

$yq[3][9]="<p>龙下碧潭添秀色，虎逢山谷转精神。</p><p>大吉大利，一航风顺，好运。男性益妻。</p>";

$yq[4][0]="<p>不料支来蔽明月，谁知冷雪透衣襟。</p><p>防体差，冲财忌远道求财，宜守旧业。</p>";

$yq[4][1]="<p>事须三思而后行，不可自作误聪明。</p><p>运如浮萍，不凶不吉平稳。益同胞之运。</p>";

$yq[4][2]="<p>橘井泉香丹现色，杏花春暖玉生辉。</p><p>财运通，威望高，有贵人扶持，幸运。</p>";

$yq[4][3]="<p>老之将至君不知，有灾有难侵人危。</p><p>财源一般，防小人暗算，有钱宜购置，平运。</p>";

$yq[4][4]="<p>贵并刘宽富石崇，富贵能有几人闻。</p><p>收入高，有购置建设等好事。女性益夫。</p>";

$yq[4][5]="<p>山高水深多险处，果有舟车不易行。</p><p>冲财生风波，防受骗上当。</p>";

$yq[4][6]="<p>南楼惟报三更月，半夜子规尚且啼。</p><p>收入不高，生风波，官场交际防官非，冲长辈体差。</p>";

$yq[4][7]="<p>早岁发财如饮水，中年得利似雷鸣。</p><p>财运通收入高，办事能就，幸运。</p>";

$yq[4][8]="<p>克勤克俭称淑女，内助持家数有方。</p><p>防财物丢失，积畜宜购置，平运。</p>";

$yq[4][9]="<p>目前运到人得爽，处处春风草木荣。</p><p>有贵人扶持，吉祥之运。男性益妻。</p>";

$yq[5][0]="<p>双飞紫燕两分飞，夫君不永命先归。</p><p>小冲财，出外防财物丢失，收入一般。</p>";

$yq[5][1]="<p>叩门声急是非多，一见官非病又难。</p><p>运气平平，益同胞之运。</p>";

$yq[5][2]="<p>无端夜雨迷秋月，不意狂风折好花。</p><p>财源广进，有购置建设等好事。</p>";

$yq[5][3]="<p>飞符为患又为灾，啾唧无端水破财。</p><p>有得有失，存款宜购置，平运。</p>";

$yq[5][4]="<p>玉兔催人投宿处，金鸡唤客束行装。</p><p>一航风顺，财运通，有购置建设等好事，但好事中有小阻。女性益夫。</p>";

$yq[5][5]="<p>如花开时便凋残，恨杀无情风雨催。</p><p>冲财生挫折，不宜远走求财。</p>";

$yq[5][6]="<p>风雨凄凄正愁人，窗前寂寞有谁知。</p><p>防与人发生纠纷，官场交际防官非，生挫折。</p>";

$yq[5][7]="<p>一朝烟雨一朝晴，晴不多时雨又淋。</p><p>财运通，谋事有贵人扶持，幸运。</p>";

$yq[5][8]="<p>一日愁来百事多，心中烦恼乱如麻。</p><p>运气一般，小冲财，存款宜购置，守旧业较好。</p>";

$yq[5][9]="<p>黄金久淹在泥沙，有日开藏世共挎。</p><p>威信高，收入高，顺利。男性益妻。</p>";

$yq[6][0]="<p>花枝零落怕东风，秋雨吹残满地中。</p><p>小挫折，防冲体差，收入一般。</p>";

$yq[6][1]="<p>石燕指云晴亦雨，江豚吹浪海还风。</p><p>运气平平，益同胞之运。</p>";

$yq[6][2]="<p>吩咐东君好护持，奇花遭雨坏篱坡。</p><p>平稳上升，大利之运，有购置建设等好事。</p>";

$yq[6][3]="<p>多因风雨花零落，欲流清溪欠便盘。</p><p>防小人暗算，做生意者应提高警惕，运气收入一般。</p>";

$yq[6][4]="<p>谋耍未通不如意，行船又遇打头风。</p><p>建威信，办事会成功，有购置好事，但好事多磨。女性益夫。</p>";

$yq[6][5]="<p>一池新水今朝雨，满地桃花昨夜风。</p><p>生风波，外出小心，防与人发生纠纷。</p>";

$yq[6][6]="<p>红颜命薄一树花，春风已抱曲琵琶。</p><p>冲财，防与人发生纠纷，生风波。女性损夫运。</p>";

$yq[6][7]="<p>六阴极处水凝冰，造物分明未有形。</p><p>大得幸运，财源亨通，谋事能就。</p>";

$yq[6][8]="<p>晓望山前雾色开，俄然风起雨又来。</p><p>财运一般，有得有失，存款宜购置。</p>";

$yq[6][9]="<p>良马努因离险路，梅花今已发阳春。</p><p>有发展，树威信，财源通。男性益妻。</p>";

$yq[7][0]="<p>燕子单飞绕画堂春风几度断肝肠。冲</p><p>财，生挫折，防冲身体，严守物业注意损失。</p>";

$yq[7][1]="<p>何须著意求佳景，自有奇逢应早春。</p><p>财运一般，宜守旧业，青年时代有同胞好坏事牵涉本人财帛。</p>";

$yq[7][2]="<p>楼阁重重明月满，栏干曲曲好花扶。</p><p>有财气，家庭好事，收入高。</p>";

$yq[7][3]="<p>支深有月光难见，海阔无风浪自生。</p><p>运气一般，防小人暗算，防与人发生是非。</p>";

$yq[7][4]="<p>芳草春回依旧绿，梅花时到自然香。</p><p>幸运，树威信，购置建设好事。女性益夫。</p>";

$yq[7][5]="<p>衡门之下可栖迟，今日徒劳枉费思。</p><p>生风波，操心，不可远方求财，驾车谨慎。</p>";

$yq[7][6]="<p>满面春风人道好，多少不足自家和。</p><p>操心浮动，生风波，官场交际防官非或冲长辈。</p>";

$yq[7][7]="<p>浮云卷尽碧天空，春风融和瑞气多。</p><p>福从天来，合想得财，树好形象，顺利，或有录用提升。</p>";

$yq[7][8]="<p>五风十雨皆为瑞，万紫千红总是春。</p><p>运气一般，有得有失，谨防耗财。</p>";

$yq[7][9]="<p>扫开天上云千丈，捧出波心月一轮。</p><p>大得幸运，可发展，但要防得后复失。男性益妻。</p>";

$yq[8][0]="<p>七夕有云天淡淡，中秋无月夜朦朦。</p><p>耗财伤体，驾车小心，谨防财物注意丢失。</p>";

$yq[8][1]="<p>下贺高帆游大海，忽然一阵打头风。</p><p>平安平稳，益同胞之运。</p>";

$yq[8][2]="<p>数注紫衣人指人，财禄功名自有期。</p><p>大得幸运，有发展，顺利。</p>";

$yq[8][3]="<p>静坐有经清白日，闲赤无事伴红尘。</p><p>伤威信，小耗财，求稳守旧业则可。</p>";

$yq[8][4]="<p>嫩竹出竿风势恶，全凭老竹傍其身。</p><p>财源广进，有购置建设等好事。女性益夫。</p>";

$yq[8][5]="<p>牡丹原是百花王，开向人间分外香。</p><p>工作浮动，防小人暗算，驾车谨慎，夜勿远走。</p>";

$yq[8][6]="<p>财源好似春江水，滚滚流来日夜长。</p><p>生挫折，不宜远道求财，守旧业则顺序。</p>";

$yq[8][7]="<p>时来兴发如川至，运到财源似水流。</p><p>有意外来财，收入高，谋事能就，可提升。</p>";

$yq[8][8]="<p>财如春水源源进，福似朝花朵朵新。</p><p>平运，防得后复失，存款宜购置，守旧业较好。</p>";

$yq[8][9]="<p>改换门闾事更新，锦衣玉食福乃臻。</p><p>财源广进，工作顺利，好运。男性益妻。</p>";

$yq[9][0]="<p>乍雨乍晴春不定，花开花落两无情。</p><p>损财，办事生挫折，防冲体生暗疾。</p>";

$yq[9][1]="<p>水满池塘花满枝，青鲜叶里自闻香。</p><p>稳步上升，家中有小合想事。益同胞之运。</p>";

$yq[9][2]="<p>钓得鱼儿已上钩，俄然跃起水中游。</p><p>树威信，工作顺利，办事成功。</p>";

$yq[9][3]="<p>有缘有财过晚景，无忧无虑乐升平。</p><p>进退不定，防小人暗算，守旧业可也。</p>";

$yq[9][4]="<p>笔走龙蛇高万丈，一举扬名压富豪。</p><p>大得幸运，顺利，有购置建设等好事。女性益夫。</p>";

$yq[9][5]="<p>五行秀气色生财，天光雾月乐悠悠。</p><p>生挫折，防与人发生纠纷。</p>";

$yq[9][6]="<p>虽有浮云掩月光，俨然风卷云收藏。</p><p>冲财，冲长辈体差，官场交际防官非。</p>";

$yq[9][7]="<p>天赐祯祥纳庆多，花前月下听高歌。</p><p>工作顺利，好运气，收入高。</p>";

$yq[9][8]="<p>走遍江山千万里，徒劳心事想东西。</p><p>小冲财，出外防小人暗算。</p>";

$yq[9][9]="<p>南方运转北方地，一生衣禄永无优。</p><p>一航风顺，财利双收。男性益妻。</p>";



$ssjs[0]="<p><font color=green>十神为比劫：</font>其表象范围大多与本身的思想言行、陈规陋习、决策计划，以及朋友、同辈、兄弟姐妹等有关。</p><p>吉象：理想远大，进取心强，有主见，敢于与不良现象作斗争。</p><p>凶象：不容易听取别人的意见，固执已见、独断专行，多招惹诽谤有伤名誉。做事没有恒心，说的多做的少。易染上酗酒赌博等恶习。男性要防婚变，女性婚期早不利。</P>";

$ssjs[1]="<p><font color=green>十神为比肩：</font>其表象范围大多与本身的事业、思想言行、决策、健康安全，以及兄弟姐妹、同学、同事、朋友、近邻等有关。</p><p>吉象：个性张扬，事业心较强，勇于向不利环境挑战，在异乡较顺利，较得朋友之助力。</p><p>凶象：易争强斗胜、独断专行，常遭小人陷害，或受兄弟姐妹、同事或朋友拖累而破财，合作事业易散伙，父亲受牵累。夫妻易生是非。</P>";

$ssjs[2]="<p><font color=green>十神为正印：</font>其表象范围大多与学业、艺术，以及长辈、师长、母亲、女婿等有关。</p><p>吉象：自己的天赋较易发挥，学业艺术方面有发展。</p><p>凶象：劳神费心，工作受自己的情绪影响较大，女性不利子女。</P>";

$ssjs[3]="<p><font color=green>十神为偏印：</font>其表象范围大多与学术研究、爱好特长，以及长辈、 贵人、母亲等有关。</p><p>吉象：较易得贵人帮助，爱好特长易发挥，学术研究较易有成就。</p><p>凶象：学业或事业有波折，生活不安定，名誉有损，或母亲有事。不利子女，易发生交通事故。</P>";

$ssjs[4]="<p><font color=green>十神为正官：</font>其表象范围大多与职位、名誉、权力、事业竞争、上司，以及子女、女性的丈夫或男友等有关。</p><p>吉象：职位权力易稳固或上升，官司易获胜诉或平反，学业或事业较顺利。男性较易获得子女尊重。女性的丈夫较有地位或权威。</p><p>凶象：易遭诽谤财受损，易发生是非争执，影响职位、名誉，兄弟姐妹易发生刑伤。女性之丈夫或男友易有不利事。</P>";

$ssjs[5]="<p><font color=green>十神为七杀：</font>其表象范围大多与武职、军衔、诉讼、外敌、建筑，以及儿女、女性的情人等有关。</p><p>吉象：做事干脆利落，工作效率高，较易文成武就。侠义助人受人感激，名声显赫，有地位或有权威。</p><p>凶象：个性太张扬，聪明反被聪明误，自己容易受损失。生活起伏较大，身体易受伤残。女性早婚不利。</P>";

$ssjs[6]="<p><font color=green>十神为伤官：</font>其表象范围大多与理想追求、爱好特长、文学技术、公共关系、迁移调动，以及儿女、学生、晚辈、部属、性欲等有关。</p><p>吉象：比平时有较高的智慧和才能，聪明智谋多，在音乐艺术、爱好特长方面较易成功。</p><p>凶象：本性过度暴露，惹事生非好管事，易与人产生过节，孤独寂寞。男性易盲目追求爱情而有损名誉及事业。女性防婚姻不顺利。</P>";

$ssjs[7]="<p><font color=green>十神为食神：</font>其表象范围大多与开业迁居、文学写作、自由职业、专业技术，以及子女、学生、下属、性欲等有关。</p><p>吉象：学业事业较易进步和成功，天赋较易发挥。爱情也较易产生和进展，易交桃花运。女性较易怀胎生育。</p><p>凶象：聪明易被聪明误，产生矛盾，引起官司诉讼。外表光华内里平淡，防过度劳神而损身心；盲目追求爱情而有损名誉及事业。男女要防矛盾和婚变。</P>";

$ssjs[8]="<p><font color=green>十神为偏财：</font>其表象范围大都与商业、财产、金钱，以及父亲、男性的情人、女性的婆婆等有关。</p><p>吉象：人缘好口碑佳，生意买卖比较顺利，富裕发达。男性风流豪爽，易得女人喜欢。</p><p>凶象：本地求财不易得，财虽多但不易存下，婚姻感情易变。</P>";

$ssjs[9]="<p><font color=green>十神为正财：</font>其表象范围大都与财产、金钱，以及父亲、男性的妻子或女友等有关。</p><p>吉象：财运亨通，有比平时较多求财的机遇。父亲较有利，或容易交上女友，姻缘不错。</p><p>凶象：易引起财产或金钱纠纷，意外破耗。财多伤母克妻，易发生感情破裂。</P>";


/*
echo $term1."6<br>";
echo $term2."7<br>";
echo $cY."8<br>";
echo $cM."9<br>";
echo $cD."10<br>";
echo $cH."11<br>";*/
if(!$name or !$y  or  !$m  or  !$d  or  !$name  or  !$term1  or  !$term2  or  !$cY  or  !$cM  or  !$cD  or  !$cH){
$term1='0/(1月5日12:33)';
$term2='1/(1月20日5:51)';
$cY='148';
$cM='1368';
$cD='41283';
$cH='495276';	
}



$Gan=array("甲","乙","丙","丁","戊","己","庚","辛","壬","癸");

$Zhi=array("子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥");

$Animals=array("鼠","牛","虎","兔","龙","蛇","马","羊","猴","鸡","狗","猪");

$wh=array("木","火","土","金","水");

$ys=array("绿","红","黄","白","黑");

$yy=array("阳","阴");

$solarTerm =array("小寒","大寒 ","立春","雨水 ","惊蛰","春分 ","清明","谷雨 ","立夏","小满 ","芒种","夏至 ","小暑","大暑 ","立秋","处暑 ","白露","秋分 ","寒露","霜降 ","立冬","小雪 ","大雪","冬至 ");

$shiShen=array("比劫","比肩","正印","偏印","正官","七杀","伤官","食神","偏财","正财");

$dz=array(9,5,0,1,4,2,3,5,6,7,4,8);

$riGan=array(array(1,0,7,6,8,9,5,4,3,2),array(0,1,6,7,9,8,4,5,2,3),array(3,2,1,0,7,6,8,9,5,4),array(2,3,0,1,6,7,9,8,4,5),array(5,4,3,2,1,0,7,6,8,9),array(4,5,2,3,0,1,6,7,9,8),array(8,9,5,4,3,2,1,0,7,6),array(9,8,4,5,2,3,0,1,6,7),array(7,6,8,9,5,4,3,2,1,0),array(6,7,9,8,4,5,2,3,0,1));function cyclical($num){

    global $Gan,$Zhi;

    return($Gan[$num%10].$Zhi[$num%12]);

}

$SC = $Zhi[$cH%12];

$y10=$cY%10;

$m10=$cM%10;





$d10=$cD%10;

$h10=$cH%10;

$y12=$cY%12;

$m12=$cM%12;

$d12=$cD%12;

$h12=$cH%12;

$ywh=floor($cY%10/2);

$mwh=floor($cM%10/2);

$dwh=floor($cD%10/2);

$hwh=floor($cH%10/2);

$yyy=$y10%2;

$myy=$m10%2;

$dyy=$f10%2;

$hyy=$h10%2;$wY = $wh[$ywh];

$wM = $wh[$mwh];

$wD = $wh[$dwh];

$wH = $wh[$hwh];

$sY = $ys[$ywh];

$sM = $ys[$mwh];

$sD = $ys[$dwh];

$sH = $ys[$hwh];

$yY = $yy[$y10%2];

$yM = $yy[$m10%2];

$yD = $yy[$d10%2];

$yH = $yy[$h10%2];

$aY = $Animals[$y12];

$aM = $Animals[$m12];

$aD = $Animals[$d12];

$aH = $Animals[$h12];





if($yyy==$sex){

    $termdate=$end_term;

    $dr=$cM+1;

    $dr_gz=cyclical($dr)."".cyclical($dr+1)."&nbsp;".cyclical($dr+2)."".cyclical($dr+3)."&nbsp;".cyclical($dr+4)."&nbsp;".cyclical($dr+5)."".cyclical($dr+6)."&nbsp;".cyclical($dr+7);

    $dr_ss=$shiShen[$riGan[$d10][$dr%10]]."".$shiShen[$riGan[$d10][($dr+1)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr+2)%10]]."".$shiShen[$riGan[$d10][($dr+3)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr+4)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr+5)%10]]."".$shiShen[$riGan[$d10][($dr+6)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr+7)%10]];

}else{

    $termdate=$start_term;

    $dr=$cM - 1;

    $dr_gz=cyclical($dr)."".cyclical($dr-1)."&nbsp;".cyclical($dr-2)."".cyclical($dr-3)."&nbsp;".cyclical($dr-4)."&nbsp;".cyclical($dr-5)."".cyclical($dr-6)."&nbsp;".cyclical($dr-7);

    $dr_ss=$shiShen[$riGan[$d10][$dr%10]]."".$shiShen[$riGan[$d10][($dr-1)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr-2)%10]]."".$shiShen[$riGan[$d10][($dr-3)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr-4)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr-5)%10]]."".$shiShen[$riGan[$d10][($dr-6)%10]]."&nbsp;".$shiShen[$riGan[$d10][($dr-7)%10]];

}$dayday = $start_term/60/60/24; $allday=$termdate/60/12;

$nnnn =  floor($allday/360);

$mmmm = floor(($allday%360)/30);

$dddd =  ceil(($allday%360)%30);$term_old=$mmmm*2+floor(($dayday+$dddd)/30)*2+$zc_11[1];

$term_m= $term_old%24;

$add_y=floor($term_old/24);

$term_mn=$solarTerm[$term_m];

$term_d=ceil($dayday+($allday%360)%30)%30;

$term_m>5?$term_day=8:$term_day=6;

$gl_m=($term_m/2+1+floor(($term_day+$term_d)/30))%12;

$gl_d=($term_day+$term_d)%30;

$dr_y=$y+$nnnn+$add_y;

if($gl_m<2 or ($gl_m==2 and $gl_d<5))$dr_y=$y+$nnnn+$add_y-1;

$dr_cY=$Gan[($dr_y-1900+36)%10];

$dr_cY2=$Gan[($dr_y-1900+36+5)%10];

$dayundate="出生后从".$nnnn."岁".$mmmm."月".$dddd."天上运，逢".$dr_cY."、".$dr_cY2."年的".$term_mn."后第".$term_d."日（公历".$gl_m."月".$gl_d."日前后）交运。

<br>在交运期前后您的命运将有重大的改变和吉凶极端的际遇，凡事宜谨慎!<br>"; 





$yq_y1=date("Y")-3;





if($dr_y>=$yq_y1) $yq_y1+=10;

if($dr_y>=$yq_y1) $yq_y1+=10;

for($f=$yq_y1; $f<($yq_y1+11); $f++) {

    $yq_s3=$yq_s1;

	if($yyy==$sex)$yq_gz=$dr+floor(($f-$dr_y)/10);

    else  $yq_gz=$dr-floor(($f-$dr_y)/10);

    if((($f-$dr_y)%10)<5)$yq_g=$yq_gz%10;

    else $yq_g=$dz[$yq_gz%12];

    $yq_s1=$riGan[$d10][$yq_g];

    $yq_s2=$riGan[$d10][($f-1900+36)%10];

    if((($f-$dr_y)%5)==0 and ($gl_m>2 or ($gl_m==2 and $gl_d>4))){

        if($yq_s3)$yq_text.="<font color=blue>".$f."年 2月 4日～★".$f."年 ".$gl_m."月 ".$gl_d."日：</font><br>\n".$yq[$yq_s3][$yq_s2]."<br>\n";

        $yq_text.="<font color=blue>"."★".$f."年 ".$gl_m."月 ".$gl_d."日～".($f+1)."年 2月 4日：</font><br>\n".$yq[$yq_s1][$yq_s2]."<br>\n".$ssjs[$yq_s2]."<br><br style=line-height:40%>\n";

    }else{

        $yq_text.="<font color=blue>".$f."年 2月 4日～".($f+1)."年 2月 4日：</font><br>\n".$yq[$yq_s1][$yq_s2]."<br>\n".$ssjs[$yq_s2]."<br><br style=line-height:40%>\n";

    }

} 







$myq_y=$riGan[$d10][($f-1900+36)%10];

$myq_m=($y-1900)*12+$m+12;

$myq_m=$Gan[$myq_m%10];

$myq_m=$iGan[$d10][$myq_m];$myq_m=date("m");

$myq_y=date("Y");

if($myq_m<=0){$myq_y--;$myq_m+=12;}

$myq_mm=array(0,6,4,6,5,5,6,7,8,8,8,7,7);

$b1=$myq_m;

$myq_y1=$myq_y;

for($b=$myq_m; $b<($myq_m+12); $b++) {

    $myq_y3=$myq_y1;

    if($b1>12){$b1=$b1-12;$myq_y3=$myq_y1;$myq_y1++;}

    $b2=$b1+1;

    $myq_y2=$myq_y1;

    if($b2>12){$b2=$b2-12;$myq_y2++;}

    $myq_ys=$riGan[$d10][($myq_y3-1900+36)%10];

    $myq_ms=$riGan[$d10][(($myq_y1-1900)*12+$b1+12)%10];

   

	$myq_text.="<font color=blue>".$myq_y1."年 ".$b1."月 ".$myq_mm[$b1]."日～".$myq_y2."年 ".$b2."月 ".$myq_mm[$b2]."日：</font><br>\n".$yq[$myq_ys][$myq_ms]."\n".$ssjs[$myq_ms]."\n";

    $b1++;

}

$ganNum=array(array(1.2,1.2,1.0,1.0,1.0,1.0,1.0,1.0,1.2,1.2),array(1.06,1.06,1.0,1.0,1.1,1.1,1.14,1.14,1.1,1.1),array(1.14,1.14,1.2,1.2,1.06,1.06,1.0,1.0,1.0,1.0),array(1.2,1.2,1.2,1.2,1.0,1.0,1.0,1.0,1.0,1.0),array(1.1,1.1,1.06,1.06,1.1,1.1,1.1,1.1,1.04,1.04),array(1.0,1.0,1.14,1.14,1.14,1.14,1.06,1.06,1.06,1.06),array(1.0,1.0,1.2,1.2,1.2,1.2,1.0,1.0,1.0,1.0),array(1.04,1.04,1.1,1.1,1.16,1.16,1.1,1.1,1.0,1.0),array(1.06,1.06,1.0,1.0,1.0,1.0,1.14,1.14,1.2,1.2),array(1.0,1.0,1.0,1.0,1.0,1.0,1.2,1.2,1.2,1.2),array(1.0,1.0,1.04,1.04,1.14,1.14,1.16,1.16,1.06,1.06),array(1.2,1.2,1.0,1.0,1.0,1.0,1.0,1.0,1.14,1.14));

$zhi2ganNum=array(1,3,2,1,3,2,1,3,2,1,3,2);

$zhi2gan=array(array(9),array(9,7,5),array(2,0),array(1),array(1,9,4),array(6,2),array(3),array(3,1,5),array(8,6),array(7),array(7,3,4),array(0,8));

$zhiNum=array(array(1.2,1.1,1,1,1.04,1.06,1,1,1.2,1.2,1.06,1.14),array(0.36,0.33,0.3,0.3,0.312,0.318,0.3,0.3,0.36,0.36,0.318,0.342),array(0.2,0.228,0.2,0.2,0.23,0.212,0.2,0.22,0.228,0.248,0.232,0.2),array(0.5,0.55,0.53,0.5,0.55,0.57,0.6,0.58,0.5,0.5,0.57,0.5),array(0.3,0.3,0.36,0.36,0.318,0.342,0.36,0.33,0.3,0.3,0.342,0.318),array(0.84,0.742,0.798,0.84,0.77,0.7,0.7,0.728,0.742,0.7,0.7,0.84),array(1.2,1.06,1.14,1.2,1.1,1,1,1.04,1.06,1,1,1.2),array(0.36,0.318,0.342,0.36,0.33,0.3,0.3,0.312,0.318,0.3,0.3,0.36),array(0.24,0.22,0.2,0.2,0.208,0.2,0.2,0.2,0.24,0.24,0.212,0.228),array(0.5,0.55,0.53,0.5,0.55,0.6,0.6,0.58,0.5,0.5,0.57,0.5),array(0.3,0.342,0.3,0.3,0.33,0.3,0.3,0.33,0.342,0.36,0.348,0.3),array(0.7,0.7,0.84,0.84,0.742,0.84,0.84,0.798,0.7,0.7,0.728,0.742),array(1,1,1.2,1.2,1.06,1.14,1.2,1.1,1,1,1.04,1.06),array(0.3,0.3,0.36,0.36,0.318,0.342,0.36,0.33,0.3,0.3,0.312,0.318),array(0.24,0.212,0.228,0.24,0.22,0.2,0.2,0.208,0.212,0.2,0.2,0.24),array(0.5,0.55,0.53,0.5,0.55,0.57,0.6,0.58,0.5,0.5,0.57,0.5),array(0.36,0.33,0.3,0.3,0.312,0.318,0.3,0.3,0.36,0.36,0.318,0.342),array(0.7,0.798,0.7,0.7,0.77,0.742,0.7,0.77,0.798,0.84,0.812,0.7),array(1,1.14,1,1,1.1,1.06,1,1.1,1.14,1.2,1.16,1),array(0.3,0.342,0.3,0.3,0.33,0.318,0.3,0.33,0.342,0.36,0.348,0.3),array(0.2,0.2,0.24,0.24,0.212,0.228,0.24,0.22,0.2,0.2,0.208,0.212),array(0.5,0.55,0.53,0.5,0.55,0.57,0.6,0.58,0.5,0.5,0.57,0.5),array(0.36,0.318,0.342,0.36,0.33,0.3,0.3,0.312,0.318,0.3,0.3,0.36),array(0.84,0.77,0.7,0.7,0.728,0.742,0.7,0.7,0.84,0.84,0.724,0.798));$whNum=array(0,0,0,0,0);  $yGanNum=$ganNum[$m12][$y10];

$mGanNum=$ganNum[$m12][$m10];

$dGanNum=$ganNum[$m12][$d10];

$hGanNum=$ganNum[$m12][$h10];$whNum[$ywh]+=$yGanNum;

$whNum[$mwh]+=$mGanNum;

$whNum[$dwh]+=$dGanNum;

$whNum[$hwh]+=$hGanNum;

function zhi2ganSN($y12) {             

    global $zhi2ganNum,$riGan,$d10,$zhi2gan,$zhiNum,$whNum,$m12;

    $yZhiNum=$zhi2ganNum[$y12];

    $yyy=0;$yyx=0;while($yyy<$y12){$yyx+=$zhi2ganNum[$yyy];$yyy++;}

    if($yZhiNum==1){

        $yZhiNum1=$zhiNum[$yyx][$m12];

        $whNum[floor(($zhi2gan[$y12][0])/2)]+=$yZhiNum1;

    }elseif($yZhiNum==2){

       

        $yZhiNum1=$zhiNum[$yyx][$m12];

        $whNum[floor(($zhi2gan[$y12][0])/2)]+=$yZhiNum1;

        $yZhiNum2=$zhiNum[$yyx+1][$m12];

        $whNum[floor(($zhi2gan[$y12][1])/2)]+=$yZhiNum2;

    }else{

        $yZhiNum1=$zhiNum[$yyx][$m12];

        $whNum[floor(($zhi2gan[$y12][0])/2)]+=$yZhiNum1;

        $yZhiNum2=$zhiNum[$yyx+1][$m12];

        $whNum[floor(($zhi2gan[$y12][1])/2)]+=$yZhiNum2;

        $yZhiNum3=$zhiNum[$yyx+2][$m12];

        $whNum[floor(($zhi2gan[$y12][2])/2)]+=$yZhiNum3;

    }

}

zhi2ganSN($y12);zhi2ganSN($m12);zhi2ganSN($d12);zhi2ganSN($h12);

$whNum[0]*=10;$whNum[1]*=10;$whNum[2]*=10;$whNum[3]*=10;$whNum[4]*=10;$wh1="<!--同类：-->";

$wh1Num=0;

$whh1="";

$whn1=0;

$wh2="<!--异类：-->";

$wh2Num=0;

$whh2="";

$whn2=0;

$zzz1=0;

$zzz2=0;function whwh($num) {

    global $riGan,$d10,$wh,$whNum,$wh1,$wh1Num,$wh2,$wh2Num,$whh1,$whn1,$whh2,$whn2,$zzz1,$zzz2;

    if($riGan[$d10][$num*2]<4){

        $wh1.=$wh[$num].$whNum[$num]."; "; $wh1Num+=$whNum[$num];

        if($whNum[$num]<=$whn1){$whh1=$num;$whn1=$whNum[$num];}

        if($zzz1==0){$whh1=$num;$whn1=$whNum[$num];$zzz1=1;}

    }else{

        $wh2.=$wh[$num].$whNum[$num]."; "; $wh2Num+=$whNum[$num];

        if($whNum[$num]<=$whn2){$whh2=$num;$whn2=$whNum[$num];}

        if($zzz2==0){$whh2=$num;$whn2=$whNum[$num];$zzz2=1;}

    }

}

whwh(0);whwh(1);whwh(2);whwh(3);whwh(4);

$wh12Num=$wh1Num-$wh2Num;

if($wh12Num>7)$wh123="八字过硬";

elseif($wh12Num<-7)$wh123="八字过弱";

else $wh123="八字比较平衡";

if($wh12Num>0)$whh=$whh2;

elseif($wh12Num<0)$whh=$whh1;

else {

    if($whh2>$whh1)$whh=$whh1;

    else $whh=$whh2;

}


?>