<?
$jq=array("立春","雨水","惊蛰" ,"春分" ,"清明" ,"谷雨" ,"立夏" ,"小满","芒种","夏至","小暑","大暑","立秋" ,"处暑","白露","秋分" ,"寒露" ,"霜降" ,"立冬","小雪" ,"大雪","冬至","小寒" ,"大寒");

$tg=array("甲","乙","丙","丁","戊","己","庚","辛","壬","癸");
$dz=array("子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥");
$dc=array("癸","癸辛己","甲丙戊","乙","乙戊癸","庚丙戊","己丁","乙己丁","戊庚壬","辛","辛丁戊","壬甲");
$liuyi=array("戊甲子","己甲戌","庚甲申","辛甲午","壬甲辰","癸甲寅","丁奇星奇","丙奇月奇","乙奇日奇");//'三奇六议
$bamen=array("休门","生门","伤门","杜门","景门","死门","惊门","开门");
$jiuxing=array("天蓬星","天任星","天冲星","天辅星","天英星","天芮星","天柱星","天心星","天禽星");
$bashen=array("直符","腾蛇","太阴","六合","白虎","玄武","九地","九天");
$Fjiuxing=array("蓬","芮","冲","辅","禽","心","柱","任","英");
$Fjiumen=array("休","死","伤","杜","中","开","惊","生","景");//  '飞宫九门九神
$fJiushen=array("值符","腾蛇","太阴","六合","勾陈","太常","朱雀","九地","九天");
$fyJiushen=array("值符","腾蛇","太阴","六合","白虎","太常","玄武","九地","九天" ); 
//'64卦
$gua=array("111111","011111","001111","000111","000011","000001","000101","111101","110110","010110","000110","001110","001010","001000","001100","110100","101101","001101","011101","010101","010001","010011","010111","101111","100100","000100","010100","011100","011000","011010","011110","100110","011011","111011","101011","100011","100111","100101","100001","011001","010010","110010","100010","101010","101110","101100","101000","010000","001001","101001","111001","110001","110101","110111","110011","001011","000000","100000","110000","111000","111100","111110","111010","000010");
$gm=array("乾为天","天风姤","天山遁","天地否","风地观","山地剥","火地晋","火天大有","兑为泽","泽水困","泽地萃","泽山咸","水山蹇","地山谦","雷山小过","雷泽归妹","离为火","火山旅","火风鼎","火水未济","山水蒙","风水涣","天水讼","天火同人","震为雷","雷地豫","雷水解","雷风恒","地风升","水风井","泽风大过","泽雷随","巽为风","风天小畜","风火家人","风雷益","天雷无妄","火雷噬嗑","山雷颐","山风蛊","坎为水","水泽节","水雷屯","水火既济","泽火革","雷火丰","地火明夷","地水师","艮为山","山火贲","山天大畜","山泽损","火泽睽","天泽履","风泽中孚","风山渐","坤为地","地雷复","地泽临","地天泰","雷天大壮","泽天夬","水天需","水地比");
$BaGua=array("乾","兑","离","震","巽","坎","艮","坤");
$BaGuaBit=array("111","110","101","100","011","010","001","000");
$guishen=array("贵人","腾蛇","朱雀","六合","勾陈","青龙","天空","白虎","太常","玄武","太阴","天后");
$uisDz=array("丑","巳","午","卯","辰","寅","戌","申","未","子","酉","亥" );
$jsname=array("神后" ,"大吉","功曹" ,"太冲" ,"天罡" ,"太乙" ,"胜光" ,"小吉" ,"传送" ,"从魁" ,"河魁" ,"登明" ); 
$liuqin=array("兄弟","父母","官鬼","妻财","子孙");
$boshi=array("博士","力士","青龙","小耗","将军","奏书","飞廉","喜神","病符","大耗","伏兵","官府");
$changsheng=array("长生","沐浴","冠带","临官","帝旺","衰","病","死","墓","绝","胎","养");
$liunianxing=array("岁建","晦气","丧门","贯索","官符","小耗","大耗","龙德","白虎","天德","吊客","病符");
$liunianxing2=array("将星","攀鞍","岁驿","息神","华盖","劫煞","灾煞","天煞","指背","咸池","月煞","亡神");
?>